[
    {
        "title": "Trump returns to D.C. to face latest charges, steps from scene of Capitol Hill riots",
        "description": "Former U..S. president Donald Trump is scheduled to appear in D.C. court today to confront new charges related to his effort to overturn the results of the 2020 presidential election.",
        "published": "Thu, 3 Aug 2023 06:16:00 -0400",
        "link": "https://www.ctvnews.ca/world/trump-returns-to-d-c-to-face-latest-charges-steps-from-scene-of-capitol-hill-riots-1.6505018"
    },
    {
        "title": "Pittsburgh synagogue gunman sentenced to die in America's deadliest antisemitic attack",
        "description": "The man who killed 11 congregants at a Pittsburgh synagogue was formally sentenced to death Thursday, one day after a jury determined that capital punishment was appropriate for the perpetrator of the deadliest attack on Jews in U.S. history.",
        "published": "Thu, 3 Aug 2023 14:49:41 -0400",
        "link": "https://www.ctvnews.ca/world/pittsburgh-synagogue-gunman-sentenced-to-die-in-america-s-deadliest-antisemitic-attack-1.6505714"
    },
    {
        "title": "Man rams car onto sidewalk in South Korea and stabs people; at least 14 hurt",
        "description": "At least 13 people were injured in South Korea on Thursday when a man rammed a car onto a sidewalk, before stepping out of the vehicle and stabbing people inside a shopping mall in the city of Seongnam.",
        "published": "Thu, 3 Aug 2023 10:46:00 -0400",
        "link": "https://www.ctvnews.ca/world/man-rams-car-onto-sidewalk-in-south-korea-and-stabs-people-at-least-14-hurt-1.6505328"
    },
    {
        "title": "Man accused of firing shots outside Jewish school in Tennessee charged with multiple crimes",
        "description": "A man suspected of trying to enter a Jewish school with a gun in Memphis, Tennessee, on Monday and firing shots outside the building has been charged with multiple crimes, the lead agency looking into the shooting said Wednesday.",
        "published": "Wed, 2 Aug 2023 23:10:49 -0400",
        "link": "https://www.ctvnews.ca/world/man-accused-of-firing-shots-outside-jewish-school-in-tennessee-charged-with-multiple-crimes-1.6504951"
    },
    {
        "title": "An 87-year-old woman fought off an intruder, then fed him after he told her he was 'awfully hungry'",
        "description": "An 87-year-old Maine woman ably fought off a teenage attacker, then fed him because he said he was \"awfully hungry.\"",
        "published": "Thu, 3 Aug 2023 14:47:47 -0400",
        "link": "https://www.ctvnews.ca/world/an-87-year-old-woman-fought-off-an-intruder-then-fed-him-after-he-told-her-he-was-awfully-hungry-1.6505700"
    },
    {
        "title": "Protesters against Eritrea's government set fire to booths at cultural festival in Sweden",
        "description": "An Eritrea-themed cultural festival in Sweden took a turbulent turn Thursday when about a thousand anti-Eritrean government protesters set fire to booths, tore down outsdoor shelters and threw rocks, according to Swedish media.",
        "published": "Thu, 3 Aug 2023 12:04:45 -0400",
        "link": "https://www.ctvnews.ca/world/protesters-against-eritrea-s-government-set-fire-to-booths-at-cultural-festival-in-sweden-1.6505435"
    },
    {
        "title": "1-year-old girl dies after being left in a hot car for 8 hours, police in New York say",
        "description": "A 1-year-old girl in New York died after her grandmother left her in the back seat of a car for eight hours while she went to work, police said.",
        "published": "Thu, 3 Aug 2023 10:00:00 -0400",
        "link": "https://www.ctvnews.ca/world/1-year-old-girl-dies-after-being-left-in-a-hot-car-for-8-hours-police-in-new-york-say-1.6505259"
    },
    {
        "title": "Poland and Lithuania say they fear provocations from Russia and Belarus at NATO's eastern flank",
        "description": "Polish and Lithuanian leaders held an urgent meeting Thursday in a strategically sensitive area where their NATO nations border Belarus and the Russian territory of Kaliningrad, warning that they are bracing for provocations from Moscow and Minsk in the area.",
        "published": "Thu, 3 Aug 2023 08:09:00 -0400",
        "link": "https://www.ctvnews.ca/world/poland-and-lithuania-say-they-fear-provocations-from-russia-and-belarus-at-nato-s-eastern-flank-1.6505097"
    },
    {
        "title": "Russian shelling hits a landmark church in the Ukrainian city of Kherson",
        "description": "Russian shelling on Thursday damaged a landmark church in the city of Kherson that once held the remains of the renowned 18th-century commander who exerted Russian control through the southeast parts of modern Ukraine and annexed the Crimean Peninsula.",
        "published": "Thu, 3 Aug 2023 06:26:11 -0400",
        "link": "https://www.ctvnews.ca/world/russian-shelling-hits-a-landmark-church-in-the-ukrainian-city-of-kherson-1.6505023"
    },
    {
        "title": "The U.S. wants Kenya to lead a force in Haiti with 1,000 police. Watchdogs say they'll export abuse",
        "description": "As the U.S. government was considering Kenya to lead a multinational force in Haiti, it was also openly warning Kenyan police officers against violent abuses. Now 1,000 of those officers might head to Haiti to take on gang warfare.",
        "published": "Thu, 3 Aug 2023 09:38:00 -0400",
        "link": "https://www.ctvnews.ca/world/the-u-s-wants-kenya-to-lead-a-force-in-haiti-with-1-000-police-watchdogs-say-they-ll-export-abuse-1.6505221"
    }
]