[
    {
        "text": "\r\n\tDonald Trump is returning to the scene of the alleged crime.\r\n\tThe former president is scheduled to appear in D.C. court today to confront new charges related to his effort to overturn the results of the 2020 presidential election.\r\n\tThe hearing at the E. Barrett Prettyman U.S. Courthouse will play out just steps from Capitol Hill, where legions of Trump's supporters stormed Congress on Jan. 6, 2021.\r\n\tTrump faces four new charges: conspiracy to defraud the United States, conspiracy to obstruct an official proceeding, obstruction of an official proceeding and conspiracy against rights.\r\n\tTuesday's 45-page indictment -- the third against Trump in just four months -- lays out in precise detail a multi-pronged effort to prevent Joe Biden from being confirmed as U.S. president.\r\n\tTrump is already facing 74 other charges, including 34 felony counts in New York tied to hush-money payments, and 40 more in Florida over classified documents he allegedly stored at his Mar-a-Lago stronghold.\r\n\tSo far, his legal woes appear to have done nothing but help his bid to secure the Republican nomination for president in 2024 -- recent polls suggest he's running away with the race.\r\n\tThe latest case, however, is the one that is likely to resonate the most on the campaign trail, given how it lays out a direct assault on U.S. democracy, said Matthew Lebo, a politics professor at Western University in London, Ont.\r\n\tBut while it's theoretically possible Trump could withdraw from the race if convicted, previous experience suggests that's not at all likely, Lebo said.\r\n\t\"So if he goes forward and contests primaries and collects delegates, then he's going to be the nominee,\" he said. \"If he's convicted before the election, I don't know -- I can't imagine what that means.\"\r\n\tSo long as he continues to enjoy the backing of a majority of Republicans in Congress, Lebo said, it's hard to imagine him going to prison.\r\n\t\"I think he runs, and I think -- even if he's convicted, or is right in the middle of a trial -- I think he's still going to get 40 per cent of the vote,\" he said.\r\n\t\"And the Republican Party will not move away from him until he decides he's done.\"\r\n\tSpecial counsel Jack Smith used blunt language to describe the stakes when he released the indictment Tuesday.\r\n\t\"The attack on our nation's Capitol on Jan. 6, 2021, was an unprecedented assault on the seat of American democracy,\" Smith said.\r\n\t\"It was fuelled by lies -- lies by the defendant, targeted at obstructing a bedrock function of the U.S. government and the nation's process of collecting, counting and certifying the results of the presidential election.\"\r\n\tThe indictment references six different alleged co-conspirators, but does not disclose their identities. Media reports and known facts point to five names, all of them central players in the effort to overturn the results.\r\n\tThey include Trump ally Rudy Giuliani; lawyer John Eastman, who proposed enlisting then-vice-president Mike Pence to reject Electoral College votes; and campaign lawyer Sidney Powell, who spearheaded a doomed, conspiracy-laden court challenge.\r\n\tThe election certification ritual was playing out on Capitol Hill on Jan. 6, 2021, the day legions of Trump supporters marched from his defiant speech outside the White House and stormed Congress in an effort to thwart the proceedings.\r\n\tThey quickly turned on Pence when they learned the vice-president, who was presiding over the certification process in the Senate, would not accede to Trump's demands that he reject Electoral College votes from six key states.\r\n\tSmith's indictment also alleges that Trump and his officials had been warned of the risk of violence. A senior adviser told Eastman, one of the architects of the plan, \"You're going to cause riots in the streets.\"\r\n\tEastman -- identified in the indictment only as \"Co-Conspirator 2\" -- responded that \"there had previously been points in the nation's history where violence was necessary to protect the republic.\"\r\n\tThe following day, Pence's lawyer told Eastman that his scheme would result in a \"disastrous situation\" where the election might \"have to be decided in the streets.\"\r\n\tFor weeks, Trump has been cultivating moral support among his loyal base by framing the indictment as a politically motivated witch hunt -- a drumbeat that continued Wednesday in a flurry of social media posts and fundraising pitches.\r\n\tSo far, it's proven an effective strategy.\r\n\tAmong Republicans, he currently enjoys a staggering 37-point lead over his closest challenger, the faltering Florida Gov. Ron DeSantis, a new poll released Monday by Siena College and the New York Times suggests.\r\n\tDeSantis managed just 17 per cent support with likely Republican primary voters to Trump's 54 per cent. Former South Carolina governor Nikki Haley, Sen. Tim Scott and ex-VP Pence all sat a distant third with three per cent each.\r\n\tPerhaps more surprising, in surveying voters of all political stripes about the 2024 presidential election, that same poll found a dead heat between Trump and incumbent Biden, tied at 43 per cent.\nThis report by The Canadian Press was first published Aug. 3, 2023."
    },
    {
        "text": "\r\n\tThe man who killed 11 congregants at a Pittsburgh synagogue was formally sentenced to death Thursday, one day after a jury determined that capital punishment was appropriate for the perpetrator of the deadliest attack on Jews in U.S. history.\r\n\tU.S. District Judge Robert Colville imposed the sentence on Robert Bowers, a 50-year-old truck driver whose vicious antisemitism led him to shoot his way into a place of worship and target people for practicing their faith.\r\n\t\"I have nothing specific that I care to say to Mr. Bowers,\" Colville said, before issuing the formal sentence. \"I am however convinced there is nothing I could say to him that might be meaningful.\"\r\n\tBowers, who swapped the casual civil clothes he wore throughout the trial for a red jail suit, chose not to speak. He spent the entire hearing looking at and shuffling through papers and writing, and refused to look at those he victimized in the eye, even when invited to do so.\r\n\tBowers, from suburban Baldwin, ranted about Jews online before carrying out the attack at the Tree of Life synagogue on Oct. 27, 2018. He told police at the scene that \"all these Jews must die\" and has since expressed pride in the killings.\r\n\tJurors were unanimous in finding that Bowers' attack was motivated by his hatred of Jews, and that he chose Tree of Life for its location in one of the largest and most historic Jewish communities in the nation so he could \"maximize the devastation, amplify the harm of his crimes, and instill fear within the local, national, and international Jewish communities.\" They also found that Bowers lacked remorse.\r\n\tThe jury rejected defense claims that Bowers has schizophrenia and that his delusions about Jewish people spurred the attack.\r\n\tGrieving families confronted Bowers at Thursday's hearing before Colville pronounced the sentence, describing the pain and suffering he had inflicted, and calling him evil and cowardly.\r\n\t\"Mr. Bowers, you met my beloved husband in the kitchen. Your callous disregard for the person he was repulses me,\" testified Peg Durachko, wife of 65-year-old Dr. Richard Gottfried, a dentist who was shot and killed. \"Your hateful act took my soulmate from me.\"\r\n\tMark Simon, whose parents, Bernice and Sylvan Simon, were killed in the attack, testified he still has their bloodied prayer shawl. He said he remains haunted by the 911 call placed by his mother, whom Bowers shot while she was on the line.\r\n\t\"My parents died alone, without any living soul to comfort them or to hold their hand in their last moments,\" said Simon, condemning \"that defendant\" and urging the judge to show him no mercy.\r\n\t\"You will never be forgiven. Never,\" Simon told Bowers.\r\n\tIt was the first federal death sentence imposed during the presidency of Joe Biden, who pledged during his 2020 campaign to end capital punishment. Biden's Justice Department has placed a moratorium on federal executions and has declined to authorize the death penalty in hundreds of new cases where it could apply. But federal prosecutors said death was the appropriate punishment for Bowers, citing the vulnerability of his mainly elderly victims and his hate-based targeting of a religious community.\r\n\tAn appeal is expected, meaning that Bowers will likely spend years on federal death row even if the Justice Department lifts the moratorium on executions.\r\n\tBowers, who was armed with an AR-15 rifle and other weapons, also shot and wounded seven, including five responding police officers.\r\n\tHe was convicted in June of 63 federal counts, including hate crimes resulting in death and obstruction of the free exercise of religion resulting in death.\r\n\tIn addition to Gottfried and the Simons, the deceased victims were Joyce Fienberg, 75; Rose Mallinger, 97; Dr. Jerry Rabinowitz, 66; brothers David Rosenthal, 54, and Cecil Rosenthal, 59; Dan Stein, 71; Melvin Wax, 87; and Irving Younger, 69.\r\n\tThe judge said he couldn't begin to understand the pain of the survivors and loved ones of those killed in the attack.\r\n\t\"May their memory be a blessing,\" Colville said from the bench.\r\n\t------\nRubinkam reported from northeastern Pennsylvania."
    },
    {
        "text": "\r\n\tA man rammed a car onto a sidewalk Thursday in South Korea, then stepped out of the vehicle and began stabbing people at a shopping mall. Authorities said at least 14 people were wounded in the country's second mass stabbing in a month.\r\n\tAt least five people were hurt by the car, and nine others were stabbed in the attacks that occurred in a crowded leisure district near a subway station in the city of Seongnam, according to Yoon Sung-hyun, an official from the southern Gyeonggi provincial police department.\r\n\tThe head of the National Police Agency described the attack as \"virtually an act of terrorism.\"\r\n\tPolice did not offer any immediate information about a potential motive or about the status of those who were hurt.\r\n\tAuthorities were questioning an unidentified suspect in his 20s who was arrested at the scene.\r\n\tPhotos from the scene showed forensic units examining the halls of the AK Plaza, where the stabbings took place. A white Kia hatchback with a broken front window and ruptured front tire could be seen on a sidewalk near the subway station.\r\n\tSouth Korea's Kyunghyang Shinmun newspaper published a video on its website that it said was sent by a witness. The footage showed a man wearing sunglasses and a black hoodie walking up the mall's escalator with an object in his hand.\r\n\tA witness named Hwang Hee-woon told YTN television that he \"heard a sound from the first floor that seemed like a scream, so customers and shop workers were gathering on the rails of the second-floor near the escalator to see what was happening below.\"\r\n\t\"Suddenly, someone told us the person who committed the crime was coming up to the second floor, so we ran away in panic,\" he said, adding that he ended up hiding inside a refrigerated storage room with some mall employees.\r\n\tThe National Police Agency held an online meeting Thursday with regional police chiefs to discuss ways to deal with stabbings and other attacks against random targets.\r\n\tDuring the meeting, National Police Agency Commissioner Gen. Yoon Hee-keun made the comment about terrorism. Officials discussed increasing nighttime patrols in leisure districts and other crowded areas and strengthening security camera surveillance, according to the agency.\r\n\tLast month, a knife-wielding man stabbed at least four pedestrians on a street in the capital, Seoul, killing one person, police said."
    },
    {
        "text": "\r\n\tA man suspected of trying to enter a Jewish school with a gun in Memphis, Tennessee, on Monday and firing shots outside the building has been charged with multiple crimes, the lead agency looking into the shooting said Wednesday.\r\n\tThe Tennessee Bureau of Investigation said Joel Bowman, 31, of Stanton, Tennessee, was charged with criminal attempted second-degree murder, reckless endangerment, possessing a firearm during the commission or attempt to commit a dangerous felony, carrying weapons on school property, and assault against a first responder.\r\n\tBowman remained hospitalized in Memphis as of Wednesday, the bureau said. Officers shot Bowman after finding his truck soon after he left the school, and he was hospitalized in critical condition, police said at the time. Bowman had exited the truck with a firearm in hand, and the \"situation escalated,\" the Tennessee Bureau of Investigation said Wednesday.\r\n\tA message left at one phone listing for Bowman wasn't immediately returned, and a second phone listing rang unanswered. Representatives of the prosecutor's office and the Tennessee Bureau of Investigation didn't immediately respond to an email asking if Bowman had an attorney who could speak on his behalf.\r\n\tBowman had tried to enter Margolin Hebrew Academy-Feinstone Yeshiva of the South on Monday afternoon but was denied entrance into the building, the bureau said. He fired several shots and then left in a maroon pickup truck, police have said.\r\n\tNo one at the school was injured. Classes were not in session, and limited staff and construction workers were present, a security official said."
    },
    {
        "text": "\r\n\tAn 87-year-old Maine woman ably fought off a teenage attacker, then fed him because he said he was \"awfully hungry.\"\r\n\tMarjorie Perkins said she awoke at 2 a.m. on July 26 and saw the young man standing over her bed. He had shed his shirt and pants and told her he was going to cut her.\r\n\t\"I thought to myself, if's he's going to cut, then I'm going to kick,\" she said.\r\n\tShe put on her shoes and fought back, putting a chair between them as the two jostled in her Brunswick home. The intruder struck her on the cheek and forehead before switching tactics and heading for the kitchen. He told Perkins that he was \"awfully hungry,\" she said.\r\n\tSo, she gave him a box of peanut butter and honey crackers, two protein drinks and two tangerines.\r\n\tPerkins dialled 911 on her rotary phone and was talking to a dispatcher while the intruder collected his pants and left. He left behind a knife, shirt, shoes and a water bottle containing alcohol, she said.\r\n\tPerkins, who has become a bit of an international celebrity since the attack, said she still feels safe in the home where she's resided for 42 years, but worries about rampant crime. She said it seems to have gotten worse over the past few years and that criminals don't fear going to jail.\r\n\t\"I think our law has just folded up,\" she said. \"People aren't afraid of anything anymore. They feel they can do as they please.\"\r\n\tPolice said in a news release that they quickly tracked down the teenager and charged him with burglary, criminal threatening, assault and consuming liquor as a minor. Authorities did not release his identity because of his age. They said the teen was staying a few blocks away from the victim."
    },
    {
        "text": "\r\n\tAn Eritrea-themed cultural festival in Sweden took a turbulent turn Thursday when about a thousand anti-Eritrean government protesters set fire to booths, tore down outsdoor shelters and threw rocks, according to Swedish media.\r\n\tSwedish police said there was no immediate reports of any injuries. But Swedish newspapers said several people were hurt in connection with what the publications described as a riot.\r\n\tThe Expressen newspaper said at least nine police buses were at the site of the Festival Eritrea Scandinavia, an annual event that has been held since the 1990s at a nature reserve in northern Stockholm.\r\n\tThe festival opened Thursday and was scheduled to run through Sunday.\r\n\tSweden is home to tens of thousands of people with Eritrean roots. The festival devoted to the cultural heritage of Eritrea has been criticized for allegedly serving as a promotional tool and source of money for for the African nation's government, according to Swedish media.\r\n\tHuman rights groups describe Eritrea as one of the world's most repressive countries. The small Horn of Africa nation has been led since winning independence from Ethiopia three decades ago by President Isaias Afwerki, who has never held an election. Millions of people have fled conditions such as forced military conscription."
    },
    {
        "text": "\r\n\tA 1-year-old girl in New York died after her grandmother left her in the back seat of a car for eight hours while she went to work, police said.\r\n\tThe 54-year-old woman forgot to drop off the 14-month-old at day care on her way to work on Monday, the Suffolk County Police Department said in a news release.\r\n\t“Approximately eight hours later, the woman went to pick up the child at the day care, located on Redwood Lane in Smithtown, when she realized she had left the child in her vehicle,” police said.\r\n\tThe toddler was taken to a hospital where she was pronounced dead.\r\n\tThe death is under investigation and police have not said whether there will be any charges in the case.\r\n\tThis is the 15th child to die in hot vehicle this year, according to NoHeatStroke.org, a website run by a San Jose State University lecturer that tracks hot car deaths.\r\n\tThe high temperature Monday in Smithtown, which is located on the North Shore of Long Island, was 83 degrees.\r\n\tTemperatures inside a car can climb 20 degrees in just 10 minutes, according to the National Highway Transportation Safety Administration, and often, that’s enough to cause hyperthermia. Within an hour, car temperatures can rise more than 40 degrees, even when temperatures are low.\r\n\tA child’s body temperature rises three to five times faster than an adult’s and a child can die when their body temperature reaches 107 degrees, the safety administration said."
    },
    {
        "text": "\r\n\tPolish and Lithuanian leaders held an urgent meeting Thursday in a strategically sensitive area where their NATO nations border Belarus and the Russian territory of Kaliningrad, warning that they are bracing for provocations from Moscow and Minsk in the area.\r\n\tThe meeting came two days after two Belarusian helicopters flew briefly at low altitude into Polish air space, in what was viewed as a provocative move. Both nations on NATO's eastern flank have increased their border security following the arrival of thousands of Russia-linked Wagner group mercenaries just across their borders in Belarus after an aborted mutiny in Russia in June.\r\n\t\"Russia and Belarus are increasing the pressure on the borders, increasing the number of their provocations, and we must be aware that the number of these provocations will grow,\" Polish Prime Minister Mateusz Morawiecki said at a news conference with Lithuanian President Gitanas Nauseda.\r\n\tThe Belarusian Foreign Ministry denied that its country's helicopters entered Poland. Local Polish residents posted photos on social media of helicopters with Belarusian insignia flying above.\r\n\tThey met in Suwalki, a town in the Suwalki Gap, a sparsely populated stretch of land running 96 kilometres (60 miles) along the Polish-Lithuanian border. Also known as the Suwalki Corridor, the stretch of territory links the three Baltic states of Lithuania, Latvia and Estonia with the rest of the NATO alliance. It separates Belarus, an ally of Russia, from Kaliningrad, a heavily militarized exclave of Russia located on the Baltic Sea which is separated from the Russian mainland.\nMilitary analysts in the West have long viewed the Suwalki Gap as a potential flashpoint area in case of a standoff between Russia and NATO. They worry that if Russia were to ever seize the Suwalki Gap, it would leave Lithuania and the other two Baltic states, Latvia and Estonia, cut off from Poland and other NATO allies.\r\n\tNauseda said he believes the Suwalki Gap remains a vulnerable place, even though Sweden -- located across the Baltic Sea -- is on track to join NATO.\r\n\t\"Some people say the agreement reached at the NATO summit on Sweden's future membership is changing the geopolitical situation, and the strategic importance of the Suwalki Corridor is diminishing. I certainly do not agree with this view and I believe that the Suwalki Corridor remains a potential target of provocation by both Russia and Belarus,\" Nauseda said.\r\n\tThe NATO countries on the eastern flank have felt under pressure for a couple of years.\r\n\tLarge numbers of migrants from the Middle East and Africa began arriving two years ago at the borders of Poland, Lithuania and Latvia. European leaders have accused Belarus leader Alexander Lukashenko, an ally of Russia, of opening the migration route in an act of \"hybrid warfare\" aimed at creating instability in the West.\r\n\t\"Our borders have stopped various hybrid attacks for years. Russia and Belarus are increasing their numerous provocations and intrigues in order to destabilize the border of NATO's eastern flank,\" Morawiecki said.\r\n\t\"Today, the Polish borders and the border of Lithuania are the borders of the free world, which are stopping the pressure from the despotism from the east,\" Morawiecki said."
    },
    {
        "text": "\r\n\tRussian shelling on Thursday damaged a landmark church in the city of Kherson that once held the remains of the renowned 18th-century commander who exerted Russian control through the southeast parts of modern Ukraine and annexed the Crimean Peninsula.\r\n\tUkraine's emergency service said four of its workers were wounded in a second round of shelling as they fought the fire at St. Catherine's Cathedral. Four other people were wounded in the first shelling attack, which also hit a trolleybus, the prosecutor general's office said.\r\n\tThe shelling followed the severe damage sustained by a beloved Orthodox cathedral in a missile strike last week in Odesa and underlined the war's risk to the country's cultural monuments. Fighting has intensified in multiple regions as Ukraine's military steps up a counteroffensive to reclaim Russian-occupied territory.\r\n\tThe Kherson church, dating from 1781, is one of the city's most notable buildings. It once was the burial spot for Prince Grigory Potemkin, a favourite of Russian Empress Catherine the Great.\r\n\tHis remains were removed last year while the city was still under Russian occupation. Russian forces withdrew from Kherson last November in the face of a Ukrainian counteroffensive.\r\n\tPotemkin engineered the 1784 annexation of Crimea from the Crimean Khanate. His name entered popular speech because of stories, now widely doubted, that he erected fake settlements called \"Potemkin villages\" to impress Catherine during her long journey through Crimea and the southern territories.\r\n\tThe Ukrainian president's office said two people were killed over the past day in Russian attacks -- one in eastern Ukraine's Donetsk province and one in Zaporizhzhia province.\r\n\tThe Ukrainian air force said Russia launched a wave of 15 Shahed drones against the Kyiv region but all were shot down. The governor of the capital region, Ruslan Kravchenko, said there were no injuries or damage.\r\n\tUkraine's military also continued to launch attack drones deep into Russia. The Russian Defense Ministry said six Ukrainian drones were downed in the Kaluga region, about 150 kilometres (90 miles) south of Moscow, the latest incident following attacks that twice hit buildings in the Russian capital that house some government ministries.\r\n\tKaluga Gov. Vladislav Shapsha reported another drone was shot down later Thursday.\r\n\tAfter enduring nearly nine months of Russian occupation, Kherson was recaptured by Ukrainian forces in November of last year, marking a momentous victory for Ukraine and a humiliating defeat for the Kremlin.\r\n\tThe Ukrainian recapture of Kherson instantly made the city the front line in the country's south and a target of daily Russian attacks, mostly artillery and drone attacks mostly artillery and drones coming from Russian-held territory across the Dnieper River. The relentless strikes often result in reports of civilian casualties.\r\n\tIn early June, Kherson was shattered by the war-related collapse of Kakhovka dam, which flooded areas near the riverbank and forced thousands of residents to evacuate.\r\n\t------\nJim Heintz contributed to this report from Tallinn, Estonia."
    },
    {
        "text": "\r\n\tAs the U.S. government was considering Kenya to lead a multinational force in Haiti, it was also openly warning Kenyan police officers against violent abuses. Now 1,000 of those officers might head to Haiti to take on gang warfare.\r\n\tIt's a challenging turn for a police force long accused by rights watchdogs of killings and torture, including gunning down civilians during Kenya's COVID-19 curfew. One local group confirmed that officers fatally shot more than 30 people in July, all of them in Kenya's poorest neighbourhoods, during opposition-called protests over the rising cost of living.\r\n\t\"We are saddened by the loss of life and concerned by high levels of violence, including the use of live rounds\" during those protests, the U.S. said in a joint statement with 11 other nations in mid-July.\r\n\tNow the U.S., as this month's president of the UN Security Council, is preparing to put forward a resolution to authorize a mission in Haiti led by Kenyan police, who have relatively little overseas experience in such large numbers and don't speak French, which is used in Haiti.\r\n\t\"This is not a traditional peacekeeping force,\" the U.S. ambassador to the UN, Linda Thomas-Greenfield, said Tuesday.\r\n\tFor more than nine months, the UN had appealed unsuccessfully for a country to lead an effort to restore order to the poorest nation in the Western Hemisphere.\r\n\tKenya's interest was announced on Saturday, with its foreign minister saying his government has \"accepted to positively consider\" leading a force in Haiti and sending 1,000 police officers to train the Haitian National Police, \"restore normalcy\" and protect strategic installations.\r\n\t\"Kenya stands with persons of African descent across the world,\" Alfred Mutua said. A ministry spokesman didn't respond to questions about the force or what Kenya would receive in return.\r\n\tU.S. Secretary of State Antony Blinken on Tuesday praised Kenya for simply considering to serve, a sign of the difficulty in mustering international forces for Haiti, where deadly gang violence has exploded since the 2021 assassination of President Jovenel Moise.\r\n\tSome organizations that have long tracked alleged police misconduct in Kenya are worried.\r\n\t\"We had some consultations with Kenyan (civil society organizations) last week and there was general consensus that Kenya should not be seen to be exporting its abusive police to other parts of the world,\" Otsieno Namwaya, Kenya researcher with Human Rights Watch, told The Associated Press.\r\n\tKenya's security forces have a yearslong presence in neighbouring Somalia to counter Islamic extremists -- a deadly threat that some Kenyans say should keep police at home -- and troops have been in restive eastern Congo since last year. Past UN peacekeeping deployments include Sierra Leone.\r\n\tBut while other African nations including Rwanda, Ghana and Egypt have thousands of personnel in UN peacekeeping missions, Kenya has less than 450, according to UN data. Just 32 are police officers. The U.S. has a total of 35 personnel in UN peacekeeping missions.\r\n\t\"I have no knowledge of any complaints raised by the UN during those deployments, hence no concern on my end,\" the executive director of the watchdog Independent Medico-Legal Unit, Peter Kiama, told the AP. \"Remember, the major challenges regarding policing practices in Kenya include political interference with police command and independence, inadequate political will to reform the institution, culture of internal impunity and criminality, and inadequate internal and external accountability.\"\r\n\tWith the Haiti deployment, Kenyan police would likely be in charge instead of answering to a UN force commander as in traditional peacekeeping missions.\r\n\tHaitian Prime Minister Ariel Henry on Tuesday said he spoke with Kenyan President William Ruto to thank Kenyans for the \"demonstration of fraternal solidarity.\" Kenya plans to send a task force in the coming weeks to assess the mission's operational requirements.\r\n\t\"We have to find someone who can help us,\" one Port-au-Prince resident, Benice Pierre, said Wednesday.\r\n\tAt home, Kenya's police force has received millions of dollars in training and support from the U.S., European Union and other partners in recent years, with Washington focusing on \"promoting police accountability and professionalism.\"\r\n\tBut last week, Kenya's National Assembly saw a shouted debate, along with demands for a moment of silence, over police actions during the recent protests.\r\n\t\"The kind of brutality that has been meted out on innocent and unarmed civilians in the last couple of months has been unprecedented,\" minority leader Opiyo Wandayi said. \"Those youth that you are killing require jobs, not bullets.\"\r\n\tKenya's leading opposition party has threatened to gather evidence to submit to the International Criminal Court.\r\n\tIn response, Interior Minister Kithure Kindiki said that police have remained \"neutral, impartial and professional.\" The ministry referred questions about alleged abuses to the police, who haven't responded.\r\n\tRuto, elected president a year ago, at first praised police for their conduct during the protests, but later warned officers against extrajudicial killings as a public outcry grew.\r\n\tProblems with Kenya's police force have long been acknowledged, even by officials.\r\n\tThe National Police Service \"does not have a 'shoot to kill' policy,\" its inspector general, Hilary Mutyambai, said in a submission to a parliamentary inquiry on extrajudicial killings and enforced disappearances released in late 2021.\r\n\tBut the government-created Independent Policing Oversight Authority told the inquiry it had received 95 cases of alleged deaths because of police action in the previous seven months alone, noting \"continuous abuse of force and firearms occasioning deaths.\"\r\n\tA commissioner with the authority said last month that police weren't even reporting deaths to the body as required, which is illegal."
    }
]