[
    {
        "title": "Transgender former student sues Missouri school for making her use boys' bathroom",
        "description": "A transgender former student sued a Missouri school district on Monday for forcing her to use the boys' bathrooms or the high school's only single-stall bathroom.",
        "published": "Tue, 1 Aug 2023 19:29:31 -0400",
        "link": "https://www.ctvnews.ca/world/transgender-former-student-sues-missouri-school-for-making-her-use-boys-bathroom-1.6503110"
    },
    {
        "title": "A scorching winter: Argentina's capital breaks record for hottest start to August in 117 years",
        "description": "It was an unusually scorching winter day in Buenos Aires Tuesday, with thermometers in Argentina's capital crossing the 30-degree Celsius mark (86 degrees Fahrenheit), the hottest start of August in 117 years of records, according to the country's National Meteorological Service.",
        "published": "Tue, 1 Aug 2023 19:03:45 -0400",
        "link": "https://www.ctvnews.ca/world/a-scorching-winter-argentina-s-capital-breaks-record-for-hottest-start-to-august-in-117-years-1.6503065"
    },
    {
        "title": "Trump charged by U.S. Justice Department for efforts to overturn his 2020 presidential election loss",
        "description": "Donald Trump was indicted on felony charges Tuesday for working to overturn the results of the 2020 presidential election in the run-up to the violent riot by his supporters at the U.S. Capitol, as the Justice Department moved to hold him accountable for his efforts to block the peaceful transfer of power.",
        "published": "Tue, 1 Aug 2023 18:04:00 -0400",
        "link": "https://www.ctvnews.ca/world/trump-charged-by-u-s-justice-department-for-efforts-to-overturn-his-2020-presidential-election-loss-1.6502952"
    },
    {
        "title": "Jury weighs death penalty or life in prison for Pittsburgh synagogue shooter",
        "description": "A jury deliberated but did not reach a decision Tuesday on whether the man who killed 11 people at a Pittsburgh synagogue should receive the death penalty or life in prison without parole.",
        "published": "Tue, 1 Aug 2023 17:48:37 -0400",
        "link": "https://www.ctvnews.ca/world/jury-weighs-death-penalty-or-life-in-prison-for-pittsburgh-synagogue-shooter-1.6502927"
    },
    {
        "title": "It's Kamala Harris vs. Ron DeSantis in the fight over Florida's new teachings on slavery",
        "description": "Florida Gov. Ron DeSantis, facing heavy criticism for defending \"anti-woke\" teaching in Florida, this week teed up an unusual proposal to the nation's first Black vice president: Come debate the merits of the state's new curriculum on African-American history.",
        "published": "Tue, 1 Aug 2023 17:14:11 -0400",
        "link": "https://www.ctvnews.ca/world/it-s-kamala-harris-vs-ron-desantis-in-the-fight-over-florida-s-new-teachings-on-slavery-1.6502835"
    },
    {
        "title": "Video footage, teamwork with police helped find man accused of firing at Jewish school in Memphis",
        "description": "Information from video cameras, a close relationship with police and years of work to bolster safety measures kept a man with a gun out of a Jewish school and helped officers find him after he fired shots outside the building, a Jewish security organization said Tuesday.",
        "published": "Tue, 1 Aug 2023 19:00:23 -0400",
        "link": "https://www.ctvnews.ca/world/video-footage-teamwork-with-police-helped-find-man-accused-of-firing-at-jewish-school-in-memphis-1.6503032"
    },
    {
        "title": "Man gets 40 years for prison escape bid months before expected release date from 7-year sentence",
        "description": "A Mississippi man was sentenced Monday to 40 years in state prison for breaking out of a correctional facility and holding two people at gunpoint last year, just months before he was to have completed a seven-year sentence.",
        "published": "Tue, 1 Aug 2023 11:06:11 -0400",
        "link": "https://www.ctvnews.ca/world/man-gets-40-years-for-prison-escape-bid-months-before-expected-release-date-from-7-year-sentence-1.6502205"
    },
    {
        "title": "Niger crisis deepens as European nations evacuate and coup leaders get support from other juntas",
        "description": "France, Italy and Spain announced evacuations from Niger for their citizens and other European nationals Tuesday, concerned that they risked becoming trapped by a military coup that won backing from three other West African nations also ruled by mutinous soldiers.",
        "published": "Tue, 1 Aug 2023 06:33:00 -0400",
        "link": "https://www.ctvnews.ca/world/niger-crisis-deepens-as-european-nations-evacuate-and-coup-leaders-get-support-from-other-juntas-1.6501906"
    },
    {
        "title": "16 workers killed in the collapse of a crane being used to build a bridge in India",
        "description": "A huge crane collapsed at a highway construction site in western India, killing at least 16 workers, the country's National Disaster Response Force said Tuesday",
        "published": "Tue, 1 Aug 2023 10:23:21 -0400",
        "link": "https://www.ctvnews.ca/world/16-workers-killed-in-the-collapse-of-a-crane-being-used-to-build-a-bridge-in-india-1.6502163"
    },
    {
        "title": "'Oh my God!' Airborne car lands in sewing blogger's front yard during video",
        "description": "A sewing blogger was in the middle of recording a video when an airborne car crashed into the front yard of her Florida home.",
        "published": "Tue, 1 Aug 2023 15:28:26 -0400",
        "link": "https://www.ctvnews.ca/world/oh-my-god-airborne-car-lands-in-sewing-blogger-s-front-yard-during-video-1.6502638"
    }
]