[
    {
        "text": "\r\n\t A transgender former student sued a Missouri school district on Monday for forcing her to use the boys' bathrooms or the high school's only single-stall bathroom.\r\n\tThe American Civil Liberties Union of Missouri sued Platte County R-3 School District on behalf of the transgender female former student, identified in the lawsuit only as R.F.\r\n\tThe former student received detention twice for using the girls' restroom, according to the lawsuit. She said a male classmate harassed her and threatened her with rape when she used the boys' bathroom.\r\n\tThe lawsuit argues the school violated her rights by requiring her to use the bathroom that aligned with her sex assigned at birth or the school's single-stall gender-neutral bathroom.\r\n\t\"Forcing transgender students to use the bathroom or locker room that matches their sex designated at birth is not only discrimination but dangerous and causes serious harm to Missouri's youth,\" said Gillian Wilcox, deputy director of litigation at the ACLU of Missouri, in a statement. \"Both through the constitution and by statute the government, a school in this case, is prohibited from discriminating against the people it is supposed to protect on the basis of either their sex or disability.\"\r\n\tSuperintendent Jay Harris said in a statement that the district is \"in the early stages of evaluating the legal claims\" but plans to provide more information soon.\r\n\t\"The District's focus is, and has always been, providing a safe and caring environment for all students,\" Harris said."
    },
    {
        "text": "\r\n\tIt was an unusually scorching winter day in Buenos Aires Tuesday, with thermometers in Argentina's capital crossing the 30-degree Celsius mark (86 degrees Fahrenheit), the hottest start of August in 117 years of records, according to the country's National Meteorological Service.\r\n\tTemperatures in the South American country's capital reached 30.1 degrees Celsius on Tuesday, beating the previous record for the first day of August by more than five degrees. The previous hottest Aug. 1 was set in 1942, when temperatures reached 24.6 degrees Celsius (76.3 degrees Fahrenheit).\r\n\tTuesday also marked the first time since 2014 that the 30-degree mark was crossed during the Southern Hemisphere's winter. The previous time that happened was on Aug. 21, 2014, according to the National Meteorological Service.\r\n\t\"We are experiencing very warm conditions in the central and northern regions of Argentina,\" said Cindy Fernandez, a spokesperson for the National Meteorological Service. \"There were values in general that were 10 to 15 degrees above what is normal for this time of year.\"\r\n\tThe median maximum temperature for Argentina's capital in August is 18 degrees Celsius (64.4 degrees Fahrenheit) with a median minimum of 9 degrees Celsius (48.2 degrees Fahrenheit), according to the National Meteorological Service.\r\n\tThe record broken Tuesday comes after weeks in which much of Argentina experienced a relatively mild winter.\r\n\tThe high temperatures arrive within \"a context where we are experiencing a winter that, in general, is being very warm,\" Fernandez said.\r\n\t\"The number of cold events we've had this winter has been very few, scarce, and the few times we had cold air outbreaks, they lasted for a very short period,\" she added.\r\n\tArgentina's hottest temperature Tuesday afternoon was recorded in the town of Rivadavia in the northern Salta province, where the thermometer hit 37.2 degrees Celsius (98 degrees Fahrenheit) in mid afternoon.\r\n\tTemperatures are expected to start decreasing Wednesday afternoon in central Argentina, including the capital, Buenos Aires, but in northern Argentina the \"cold air is not going to arrive, and we will continue to have warm temperatures throughout this week until the weekend, with temperatures surpassing 30 degrees almost every day,\" Fernandez said.\r\n\tFrom central Argentina to the north, temperatures are likely to remain warmer than average for the rest of the Southern Hemisphere winter and the beginning of spring, Fernandez added."
    },
    {
        "text": "\r\n\tDonald Trump was indicted on felony charges Tuesday for working to overturn the results of the 2020 election in the run-up to the violent riot by his supporters at the U.S. Capitol, with the Justice Department acting to hold him accountable for an unprecedented effort to block the peaceful transfer of presidential power and threaten American democracy.\r\n\tThe four-count indictment, the third criminal case against Trump, provided deeper insight into a dark moment that has already been the subject of exhaustive federal investigations and captivating public hearings. It chronicles a months-long campaign of lies about the election results and says that, even when those falsehoods resulted in a chaotic insurrection at the Capitol, Trump sought to exploit the violence by pointing to it as a reason to further delay the counting of votes that sealed his defeat.\r\n\tEven in a year of rapid-succession legal reckonings for Trump, Tuesday's indictment, with charges including conspiring to defraud the United States government that he once led, was stunning in its allegations that a former president assaulted the \"bedrock function\" of democracy. It's the first time the defeated president, who is the early front-runner for next year's Republican presidential nomination, is facing legal consequences for his frantic but ultimately failed effort to cling to power.\r\n\t\"The attack on our nation's Capitol on Jan. 6, 2021, was an unprecedented assault on the seat of American democracy,\" said Justice Department special counsel Jack Smith, whose office has spent months investigating Trump. \"It was fueled by lies, lies by the defendant targeted at obstructing a bedrock function of the U.S. government: the nation's process of collecting, counting and certifying the results of the presidential election.\"\r\n\tThe Trump campaign called the charges \"fake\" and asked why it took two-and-a-half years to bring them.\r\n\tTrump was the only person charged in Tuesday's indictment. But prosecutors obliquely referenced a half-dozen co-conspirators, including lawyers inside and outside of government who they said had worked with Trump to undo the election results. They also advanced legally dubious schemes to enlist slates of fake electors in battleground states won by Democrat Joe Biden to falsely claim that Trump had actually won them.\r\n\tThe indictment accuses the defeated president and his allies of trying to \"exploit the violence and chaos\" by calling lawmakers into the evening on Jan. 6 to delay the certification of Biden's victory.\r\n\tIt also cites handwritten notes from former vice-president Mike Pence that give gravitas to Trump's relentless goading to reject the electoral votes. Pence, who is challenging Trump for the GOP presidential nomination, declined overtures from a House panel that investigated the insurrection and sought to avoid testifying before the special counsel. He appeared only after losing a court fight, with prosecutors learning that Trump in one conversation derided him as \"too honest\" to stop the certification.\r\n\tTrump is due in court Thursday, the first step in a legal process that will play out in a courthouse situated between the White House he once controlled and the Capitol his supporters once stormed. The case is already being dismissed by the former president and his supporters -- and even some of his rivals -- as just another politically motivated prosecution.\r\n\tYet the case stems from one of the most serious threats to American democracy in modern history.\r\n\tThe indictment centers on the turbulent two months after the November 2020 election in which Trump refused to accept his loss and spread lies that victory was stolen from him. The turmoil resulted in the riot at the Capitol, when Trump loyalists violently broke into the building, attacked police officers and disrupted the congressional counting of electoral votes.\r\n\tIn between the election and the riot, Trump urged local election officials to undo voting results in their states, pressured Pence to halt the certification of electoral votes and falsely claimed that the election had been stolen -- a notion repeatedly rejected by judges. Among those lies, prosecutors say, were claims that more than 10,000 dead voters had voted in Georgia along with tens of thousands of double votes in Nevada. Each claim had been rebutted by courts or state or federal officials, the indictment says.\r\n\tProsecutors say Trump knew his claims of having won the election were false but he \"repeated and widely disseminated them anyway -- to make his knowingly false claims appear legitimate, to create an intense national atmosphere of mistrust and anger, and to erode public faith in the administration of the election.\"\r\n\tThe document carefully outlined arguments that Trump has been making to defend his conduct, that he had every right to challenge the results, to use the courts, even to lie about it in the process. But in stark detail, the indictment outlines how the former president instead took criminal steps to reverse the clear verdict voters had rendered.\r\n\tThe indictment had been expected since Trump said in mid-July that the Justice Department had informed him he was a target of its investigation. A bipartisan House committee that spent months investigating the run-up to the Capitol riot also recommended prosecuting Trump on charges, including aiding an insurrection and obstructing an official proceeding.\r\n\tThe indictment includes charges of conspiring to defraud the U.S., conspiring to obstruct an official proceeding, obstructing an official proceeding and violating a post-Civil War Reconstruction Era civil rights statute that makes it a crime to conspire to violate rights that are guaranteed by the Constitution -- in this case, the right to vote.\r\n\tThe mounting criminal cases are unfolding in the heat of the 2024 race. A conviction in this case, or any other, would not prevent Trump from pursuing the White House or serving as president, though Trump as president could theoretically appoint an attorney general to dismiss the charges or potentially try to pardon himself.\r\n\tIn New York, state prosecutors have charged Trump with falsifying business records about a hush money payoff to a porn actor before the 2016 election. The trial is set to begin in March.\r\n\tIn Florida, the Justice Department has brought more than three dozen felony counts, accusing him of illegally possessing classified documents after leaving the White House and concealing them from investigators. That trial begins in May.\r\n\tProsecutors in Georgia are also investigating efforts by Trump and his allies to reverse his election loss to Biden there. The district attorney of Fulton County is expected to announce charging decisions within weeks.\r\n\tSmith's team has cast a broad net as part of his federal investigation, with his team questioning senior Trump administration officials, including Pence, before a grand jury in Washington. Prosecutors also interviewed election officials in Georgia, Wisconsin, Michigan and other battleground states won by Biden who were pressured by the Trump team to change voting results.\r\n\tRudy Giuliani, a Trump lawyer who pursued post-election legal challenges, spoke voluntarily to prosecutors. Giuliani was not named in the indictment, but appears to match the description of one of the co-conspirators. A spokesman for Giuliani said Tuesday night that Trump had a \"good-faith basis\" for the actions he took.\r\n\tAttorney General Merrick Garland last year appointed Smith, an international war crimes prosecutor who also led the Justice Department's public corruption section, as special counsel to investigate efforts to undo the election as well as Trump's retention of classified documents at his Florida home, Mar-a-Lago. Although Trump has derided him as \"deranged\" and called him politically motivated, Smith's past experience includes overseeing significant prosecutions against high-profile Democrats.\r\n\tThe Justice Department's investigations began well before Smith's appointment, proceeding alongside separate criminal probes into the rioters themselves. More than 1,000 people have been charged in connection with the insurrection, including some with seditious conspiracy.\r\n\t--------\nAssociated Press writers Colleen Long, Zeke Miller, Lindsay Whitehurst, Nomaan Merchant, Lisa Mascaro and Mary Clare Jalonick in Washington, Jill Colvin in New York, Meg Kinnard in Columbia, South Carolina, Alanna Durkin Richer in Boston, Nick Riccardi in Denver, Kate Brumback in Atlanta and Claudia Lauer in Bensalem, Pa., contributed to this report."
    },
    {
        "text": "\r\n\tA jury deliberated but did not reach a decision Tuesday on whether the man who killed 11 people at a Pittsburgh synagogue should receive the death penalty or life in prison without parole.\r\n\tRobert Bowers perpetrated the deadliest antisemitic attack in U.S. history when he stormed the Tree of Life synagogue in 2018 and opened fire, killing members of three congregations who had gathered for Sabbath worship and study.\r\n\tThe same jury that convicted Bowers in June on 63 criminal counts began deliberating his sentence around 9:30 a.m. Tuesday, and met for about seven hours before being sent home. Deliberations are expected to resume Wednesday morning.\r\n\tIn closing arguments Monday, prosecutors said the 50-year-old truck driver was clearly motivated by religious hatred, reminding jurors that Bowers had spread antisemitic content online before the attack and has since expressed pride in the killings. They urged jurors to impose a death sentence.\r\n\tBowers' lawyers asked jurors to spare his life, asserting that he acted out of a delusional belief that Jewish people were helping to bring about a genocide of white people. They said he has severe mental illness and endured a difficult childhood.\r\n\tBowers, who was armed with an AR-15 rifle and other weapons, also shot and wounded seven, including five responding police officers.\r\n\tU.S. District Judge Robert Colville thanked the jurors for their service before sending them out to deliberate.\r\n\tA short time later, jurors returned to the courtroom to look at guns that were used in the attack. As jurors huddled around the display of weapons, they asked questions of the U.S. marshal who was standing there. Bowers' attorneys objected, and the judge instructed the jury to refrain from speaking with him and to disregard everything he told them about the weapons. Colville rejected a defense request for a mistrial."
    },
    {
        "text": "\r\n\tFlorida Gov. Ron DeSantis, facing heavy criticism for defending \"anti-woke\" teaching in Florida, this week teed up an unusual proposal to the nation's first Black vice president: Come debate the merits of the state's new curriculum on African-American history.\r\n\tLess than 24 hours later, Kamala Harris was in an African Methodist Episcopal church in Orlando, firing back.\r\n\t\"I'm here in Florida,\" Harris said Tuesday to a cheering audience at a convention of Black women missionaries. \"And I will tell you there is no roundtable, no lecture, no invitation we will accept to debate an undeniable fact: There were no redeeming qualities of slavery.\"\r\n\tIt was the latest volley in a rhetorical war over Florida's new education standards that has escalated in recent days. And it highlights the elevated role that Harris has been taking: Leading the White House charge against Republicans vying to face off against President Joe Biden in the 2024 campaign.\r\n\tHarris's trip to Orlando was her second to Florida in just over a week, after the state cleared new school guidelines that, in part, require teachers to instruct middle school students that enslaved people \"developed skills which, in some instances, could be applied for their personal benefit.\" It's language that DeSantis defends against strong pushback from Democrats and leading Black Republicans on Capitol Hill.\r\n\tTwo days after the new guidelines were formally approved, Harris and her aides quickly organized a trip to the state's largest city of Jacksonville and denounced \"extremists\" who she argued were forcing \"propaganda\" on Florida schoolchildren.\r\n\tThe vice president also flew to Iowa last week and met with abortion rights advocates as top GOP presidential candidates gathered in Des Moines to address an influential state Republican Party dinner. That came on the heels of a new Iowa law that bars most abortions after six weeks of pregnancy, which is now on hold, blocked by a state judge.\r\n\tHarris's moves to seize the political offensive are a departure from years past, when she found herself under repeated Republican attacks after making scant progress on tackling the migration challenges at the U.S.-Mexico border. Harris was also the point person on the administration's efforts to bolster voting rights, which failed to gain traction on Capitol Hill.\r\n\tHer newfound aggressive posture is a natural one, Harris allies say, considering her background as a prosecutor who thrives on zeroing in on an opponent and hammering their faults.\r\n\t\"The vice president has long been an effective messenger when Americans' fundamental rights are at stake,\" said Rohini Kosoglu, Harris's former chief of staff. \"This recent attack on education, which most Americans would consider extremist, is no different.\"\r\n\tNikki Fried, chairwoman of the Florida Democratic Party, said of DeSantis: \"He took the bait.\"\r\n\t\"The fact that he doubled down and brought another week of attention to a losing issue for him gives opportunity for the vice president to reinforce the message from the White House, and to reinforce what Americans understand slavery to have been,\" Fried said.\r\n\tAt issue are Florida's revised curriculum standards, particularly the mandate on teaching middle-school students about the \"personal benefits\" of slavery. On Tuesday, Harris called it an \"attempt to gaslight us in an attempt to divide and distract our nation with unnecessary debates.\" She said the invite from DeSantis -- whom she never called out by name -- was an effort to legitimize that debate.\r\n\tDeSantis has said his critics are intentionally misinterpreting the language and notes that among the people who worked on the new standards is William B. Allen, a Black professor emeritus at Michigan State University who has defended the wording about slavery.\r\n\tStill, most of the Black Republicans in Congress have come out against Florida's new Black history curriculum, including South Carolina Sen. Tim Scott, one of DeSantis's challengers for the GOP presidential nomination, and Rep. Byron Donalds, R-Fla., a former ally of the governor who has endorsed former president Donald Trump. Rather than backing down, the DeSantis campaign has gone on the attack against critics, including Donalds, whose conservative credentials they question.\r\n\tIn his letter challenging Harris for a debate on the curriculum, DeSantis accused the vice president of trying to \"score cheap political points\" and said Florida was unique in requiring \"this level of learning about such an important subject.\"\r\n\t\"Kamala Harris got on a jet at taxpayer expense and flew to Florida to lie about the African American history standards,\" DeSantis told Fox's Bret Baier in a Monday interview. \"You can't bend the knee to the left's lies. When the left lies and creates these phony narratives, you've got to push back. They've been doing this to Republicans for years and years.\"\r\n\tAfter Harris's response in Orlando on Tuesday, Never Back Down, the super PAC supporting DeSantis, tweeted, \"Kamala Harris announces she is too afraid to meet with Ron DeSantis & the African American history scholars who created the Florida curriculum standards she is lying about.\"\r\n\tQuisha King, a Jacksonville mother of two African American girls, said she wants an apology from the vice president for spreading what she calls \"lies\" about Florida's new Black history curriculum. King said it's Harris, not DeSantis, who is continuing to fuel the controversy, adding that she has counted at least four times in recent days that Harris has spoken about the Florida standards.\r\n\t\"Personally, I want an apology. She should not be doing this,\" said King, a Black conservative activist who supports DeSantis's presidential bid. \"It's damaging for our kids. They hear it and it creates confusion.\"\r\n\tDeSantis and other Republicans are eager to make the 2024 presidential race about Harris, believing she can be a liability for Biden. DeSantis's campaign tags administration as the \"Harris-Biden administration,\" and the Florida governor has been one of a handful of Republican challengers who have suggested Harris would be the ultimate commander in chief because of Biden's advanced age.\r\n\t\"She could end up being president of the United States and I think voters need to take a hard look at that and see if that's something that they would want,\" DeSantis told CBS News last week, adding that \"I thank her\" for her rapid response against him and other Republicans around the country.\r\n\tBut Democrats say they will continue to bolster her role, which will be particularly visible this week as Biden remains on vacation in Rehoboth Beach, Delaware, and Harris steps into the spotlight Her schedule includes a trip to the critical swing state of Wisconsin later this week as well as remarks on the economy after the latest job figures are released on Friday.\r\n\t\"She's been such an effective messenger in prosecuting the case against extremist Republicans who want to rip away fundamental freedoms, attack our rights and gaslight Americans because she's got a lifetime of experience of fighting back,\" said Jaime Harrison, chairman of the Democratic National Committee. \"Unfortunately for Ron, Vice President Harris stands up to bullies and will always be a staunch defender for the people.\""
    },
    {
        "text": "\r\n\tInformation from video cameras, a close relationship with police and years of work to bolster safety measures kept a man with a gun out of a Jewish school and helped officers find him after he fired shots outside the building, a Jewish security organization said Tuesday.\r\n\tA man tried to enter Margolin Hebrew Academy-Feinstone Yeshiva of the South in Memphis, Tennessee, on Monday afternoon but was denied entrance into the building, Memphis police said. The man, whose identity has not been released, fired several shots and then left in a maroon truck, Assistant Police Chief Don Crowe said.\r\n\tNo one at the school was injured. Classes were not in session and there were only limited staff and construction workers present, a security official said.\r\n\tOfficers found the vehicle shortly afterwards in a residential neighborhood located a short drive from the school. Officers then shot him after he exited the truck with a gun in hand, Crowe said. The suspect was taken to a hospital in critical condition.\r\n\tThe Tennessee Bureau of Investigation, the lead agency looking into the shooting, declined comment Tuesday when asked for an update on the investigation.\r\n\tMonday's shooting came just over four months after a shooter opened fire at a private Christian school in Nashville and killed six people, including three nine-year-old children. That tragedy has sparked closer scrutiny of Tennessee's relaxed gun laws and renewed calls to strengthen security at both public and private schools across the state.\r\n\tThe Memphis shooting led Jewish groups to praise the teamwork shown by the school and police to neutralize the threat and capture the man accused of firing the shots.\r\n\tPolice commended the school's safety procedures, but it was not immediately clear what exact security measures kept the man out. Jewish Community Partners said in a statement that a school employee quickly contacted police about the attempt to enter the school.\r\n\tLaura Kepes Linder, the organization's president and CEO, said work over the last decade to ensure the safety of Memphis' Jewish community helped prevent a tragedy. She referenced security camera footage that helped law enforcement identify the individual with the gun.\r\n\tLinder also said \"our close relationship with MPD resulted in their quick response; our security director was at the school immediately to help manage the situation; and our school personnel were prepared.\"\r\n\tSecure Community Network, which bills itself as the official safety and security organization of the Jewish community in North America, said officials were able to get clear video images of the man, track license plates to identify him, and produce additional information about him that was shared with authorities.\r\n\tTeamwork between the school, community and law enforcement is emblematic of a national push for information sharing and security training, making the response to the threat \"neither an accident nor luck,\" said Michael Masters, the network's national director and CEO.\r\n\tMasters said the Memphis Jewish Federation and Secure Community Network have worked since 2018 to deploy a security program for synagogues, schools and a community center, led by a retired law enforcement official.\r\n\tHe said shootings in recent years at places where Jews gather, such as the Tree of Life synagogue in Pittsburgh, increased awareness for stronger security.\r\n\t\"We're simply not going to choose the time and place of the next incident,\" Masters said. \"What is in our control is our ability to prepare.\"\r\n\tAmanda Braswell, the network's regional security advisor, said safety concerns prevented her from discussing details about the school's security. But in general, methods such an an external gate with a key pad limiting access to school grounds, ballistic film on windows and glass doors, and entries that require a fob have been used around the country, she said.\r\n\tIn response to the Nashville shooting, Tennessee Gov. Bill Lee, a Republican, signed a law in May designed to place more school resource officers in public and private schools, funnel additional money into school security upgrades and require every school to submit annual safety plans to the state.\r\n\tLawmakers are expected to be called back to Nashville this month to address possible changes to the state's gun laws.\r\n\tBraswell said she met in recent weeks with independent schools in Memphis to talk about how to improve security.\r\n\tGood preparation allowed the school to avoid a situation where someone could have been injured there, Braswell said.\r\n\t\"It is so imperative that schools have an ongoing relationship with their local law enforcement before something happens,\" she said. \"You can't do this the day-of ... we worked as a whole unit yesterday, together.\""
    },
    {
        "text": "\r\n\tA Mississippi man was sentenced Monday to 40 years in state prison for breaking out of a correctional facility and holding two people at gunpoint last year, just months before he was to have completed a seven-year sentence.\r\n\tShunekndrick Huffman, 21, pleaded guilty to two counts of kidnapping and a circuit court judge sentenced him to 40 years in state prison, Rankin County District Attorney Bubba Bramlett said Monday.\r\n\tHuffman, who escaped from the Central Mississippi Correctional Facility in August 2022, had nearly completed the seven-year sentence for aggravated assault with an expected release date in December of that year.\r\n\tAfter Huffman fled the prison, he broke into a nearby home and held three people at gunpoint for hours, according to authorities. They said Huffman then stole a car from one of those held hostage before crashing it and fleeing on foot. He was later found hiding in a trash can and captured two miles (3.2 kilometres) from the prison, WLBT-TV reported.\r\n\tMississippi Department of Corrections Commissioner Burl Cain told the news station that the facility would improve its siren system to prevent future escapes."
    },
    {
        "text": " A French military transport plane carrying Europeans departed Niger on Tuesday in the first such evacuation flight since mutinous soldiers ousted the country's democratically elected president nearly a week ago and shut its borders. France, Italy and Spain all announced evacuations from Niger for their citizens and other European nationals, concerned that they risked becoming trapped by the coup that won backing Tuesday from three other West African nations also ruled by mutinous soldiers. About 600 French nationals want to leave, along with 400 people of other nationalities from Belgians to Danish, French officials said. The first flight carried mostly French nationals, and officials hope to finish the evacuation flights by Wednesday. With Niger's air space closed, France co-ordinated the evacuations with the regime that ousted the nation's leader, but without withdrawing its support for democratically elected President Mohamed Bazoum, diplomatic officials said. The ministry cited recent violence that targeted its embassy in Niamey, the capital, as one of the reasons for its decision to offer evacuation flights to its citizens and other Europeans. Spain's Defence Ministry announced preparations to evacuate more than 70 nationals, and Italy also said it was arranging a flight. The evacuations come during a deepening crisis sparked by the coup last week against Bazoum. His apparent overthrow is a blow for western nations that were working with Niger against West African extremists. In Niamey hotels, Europeans and other nationalities, including some Americans, packed bags. At the airport, hundreds of people lined up for hours waiting to leave on French evacuation flights. A former French military official who had been training the Nigerien army as a civilian told The Associated Press that he was departing even though his \"job is not finished.\" Speaking on condition of anonymity for security reasons, he said the military takeover took many people by surprise. The West African regional body known as ECOWAS announced travel and economic sanctions against Niger on Sunday and said it could use force if coup leaders don't reinstate Bazoum within one week. The UN special envoy for West Africa and the Sahel, Leonardo Santos Simao, held out hope that bloodshed could be avoided. He said during a virtual news conference Tuesday he expects ECOWAS to go ahead with the deployment of troops to Niger if Bazoum isn't restored to power. But \"I believe that other efforts are under way, so I hope the use of force will not be necessary,\" if \"everybody talks in good faith (and) wants to avoid bloodshed.\" French soldiers assist mostly French nationals in a bus waiting to be airlifted back to France on a French military aircraft, at the international Airport in Niamey, Niger, Aug. 1, 2023. (AP Photo/Sam Mednick) The new junta got backing from the military governments of Mali, Burkina Faso and Guinea. Mali and Burkina Faso said in a joint statement that \"any military intervention against Niger will be considered as a declaration of war against Burkina Faso and Mali.\" The two countries also denounced ECOWAS' economic sanctions as \"illegal, illegitimate and inhumane\" and refused to apply them. ECOWAS suspended all commercial and financial transactions between its member states and Niger, as well as freezing Nigerien assets held in regional central banks. Niger relies heavily on foreign aid, and sanctions could further impoverish its more than 25 million people. Mali and Burkina Faso have each undergone two coups since 2020, as soldiers overthrew governments claiming they could do a better job fighting increasing jihadi violence linked to al Qaeda and the Islamic State group. ECOWAS has suspended them from the bloc, but never threatened to use force. Guinea, another country under military rule since 2021, also issued a statement in support of Niger's junta and urged ECOWAS to \"come to its senses.\" The evacuations followed violence Sunday that targeted the French Embassy, with protesters burning down a door and smashing windows before the Nigerien army dispersed them. Thousands of pro-junta supporters took to Niamey's streets. Some waved Russian flags along with signs reading \"Down with France\" and supporting Russian President Vladimir Putin and telling the international community to stay away. There has been no clear explanation of the references to Russia, but some demonstrators regard it as a symbol of anti-western feelings. Some may also reflect support for the Russian mercenary group Wagner's reputation for ruthlessly suppressing militants. Niger could be following in the same footsteps as Mali and Burkina Faso, both of which saw protesters waving Russian flags after their coups, analysts say. Niger's coup could also embolden jihadi violence, some say. Boubacar Moussa, a former member of an al Qaeda linked group known as JNIM, said the military overthrow is exactly what the jihadis want because it will distract and weaken the army. \"Jihadis are very supportive of this coup that happened in Niger, because it will allow them to become very strong,\" he said. Moussa, who spoke to AP in Niamey, is part of a nationwide program to bring back jihadis, reintegrate them into society and use their help in counterterrorism efforts. It was spearheaded by Bazoum when he was minister of interior and is intended as an alternative to a military solution to stem violence across the country. The AP cannot verify that Moussa actively fought for JNIM. If ECOWAS uses force, it could also trigger violence between civilians supporting the coup and those against it, Niger analysts say. Niger's prime minister, who was appointed by Bazoum and was out of the country when the coup took place, urged the international community to help roll back the coup in order to defend democracy in West Africa. \"For the ECOWAS countries, it's a question of survival. For the international community too, it's a question of credibility. Niger must remain a democratic state,\" Prime Minister Ouhoumoudou Mahamadou said in an interview with The Associated Press in France. \"Niger is a key country in terms of security for the rest of Africa, but also for the rest of the world,\" he said. Observers believe Bazoum is being held at his house in Niamey. The first photos of him since the coup appeared Sunday evening, sitting on a couch smiling beside Chad President Mahamat Deby, who had flown in to try to mediate. Both the United States and France have sent troops and hundreds of millions of dollars of military and humanitarian aid in recent years to Niger, which was a French colony until 1960. In the capital, many people live in makeshift shelters and scramble daily to make enough money to feed their children. Niger was seen as the last partner working with the West against extremism in a Francophone region where anti-French sentiment opened the way for the Russian private military group Wagner. The U.S. will consider cutting aid if the coup is successful, the State Department said Monday. Aid is \"very much in the balance depending on the outcome of the actions in the country,\" said department spokesman Matt Miller. \"U.S. assistance hinges on continued democratic governance in Niger.\" ------ AP journalists John Leicester in Paris, Ciaran Giles in Madrid, Cara Anna in Nairobi and Kirsten Grieshaber in Berlin contributed."
    },
    {
        "text": "\r\n\tA huge crane collapsed at a highway construction site in western India, killing at least 16 workers, the country's National Disaster Response Force said Tuesday\r\n\tTelevision footage showed the collapsed crane on the ground as rescue workers looked for survivors near the site in Thane, a city just outside Mumbai. At least three people who were injured were rushed to a hospital.\r\n\tPress Trust of India reported the crane is used to install precast box girders while building highway and high-speed rail bridges.\r\n\tIndian Prime Minster Narendra Modi expressed his condolences in a message on X, the social media platform formerly known as Twitter.\r\n\t\"My deepest condolences to the families of those who lost their lives. Our thoughts and prayers are with those who are injured,\" his office said in a post."
    },
    {
        "text": "\r\n\tSewing blogger Jen Wesner was in the middle of recording a video when an airborne car crashed into the front yard of her Florida home.\r\n\tShe ran outside to help the driver, and said “all I saw were airbags.”\r\n\tThe driver, who worked for a food delivery service, appeared to be unhurt and was apologetic for the crash.\r\n\tAccording to police, the driver allegedly ran a stop sign and hit a drainage ditch that sent the car airborne, right into Wesner’s property. The vehicle stopped just a few metres from Wesner’s home.\r\n\tPolice said if there was less of an incline, the car “would have hit the house.”"
    }
]