[
    {
        "text": "A man rammed a car onto a sidewalk Thursday in South Korea, then stepped out of the vehicle and began stabbing people at a shopping mall. Authorities said at least 14 people were wounded in the country’s second mass stabbing in a month.At least five people were hurt by the car, and nine others were stabbed in the attacks that occurred in a crowded leisure district near a subway station in the city of Seongnam, according to Yoon Sung-hyun, an official from the southern Gyeonggi provincial police department.Authorities arrested a suspect in his 20s at the scene and and questioned him. Police did not identify the man or offer any immediate information about a potential motive.The head of the National Police Agency described the attack as “virtually an act of terrorism.”An official at Gyeonggi’s provincial fire department, Ha Dong-geun, said at least two of the wounded were hospitalized in serious condition.Photos from the scene showed forensic units examining the halls of the AK Plaza, where the stabbings took place. A white Kia hatchback with a broken front window and ruptured front tire could be seen on a sidewalk near the subway station.South Korea’s Kyunghyang Shinmun newspaper published a video on its website that it said was sent by a witness. The footage showed a man wearing sunglasses and a black hoodie walking up the mall’s escalator with an object in his hand.A witness named Hwang Hee-woon told YTN television that he “heard a sound from the first floor that seemed like a scream, so customers and shop workers were gathering on the rails of the second floor near the escalator to see what was happening below.”“Suddenly, someone told us the person who committed the crime was coming up to the second floor, so we ran away in panic,” he said. He ended up hiding inside a refrigerated storage room with some mall employees.Last month, a knife-wielding man stabbed at least four pedestrians on a street in the capital, Seoul, killing one person.The National Police Agency held an online meeting Thursday with regional police chiefs to discuss ways to deal with stabbings and other attacks against random targets. Officials discussed increasing nighttime patrols in leisure districts and other crowded areas and strengthening security camera surveillance, according to the agency."
    },
    {
        "text": "The U.S. military is considering putting armed personnel on commercial ships traveling through the Strait of Hormuz, in what would be an unheard of action aimed at stopping Iran from seizing and harassing civilian vessels, four American officials told The Associated Press on Thursday.America didn’t even take the step during the so-called “Tanker War,” which culminated with the U.S. Navy and Iran fighting a one-day naval battle in 1988 that was the Navy’s largest since World War II.While officials offered few details of the plan, it comes as thousands of Marines and sailors on both the amphibious assault ship USS Bataan and the USS Carter Hall, a landing ship, are on their way to the Persian Gulf. Those Marines and sailors could provide the backbone for any armed guard mission in the strait, through which 20 per cent of all the world’s crude oil passes.Iran’s mission to the United Nations did not immediately respond to a request for comment from the AP about the U.S. proposal.Four U.S. officials, who spoke on condition of anonymity to discuss the proposal, acknowledged its broad details. The officials stressed no final decision had been made and that discussions continue between U.S. military officials and America’s Gulf Arab allies in the region.Officials said the Marines and Navy sailors would provide the security only at the request of the ships involved.The Bataan and Carter Hall left Norfolk, Virginia, on July 10 on a mission the Pentagon described as being “in response to recent attempts by Iran to threaten the free flow of commerce in the Strait of Hormuz and its surrounding waters.” The Bataan passed through the Strait of Gibraltar into the Mediterranean Sea last week on its way to the Mideast.Already, the U.S. has sent A-10 Thunderbolt II warplanes, F-16 and F-35 fighters, as well as the destroyer USS Thomas Hudner, to the region over Iran’s actions at sea.The deployment has captured Iran’s attention, with its chief diplomat telling neighboring nations that the region doesn’t need “foreigners” providing security. On Wednesday, Iran’s paramilitary Revolutionary Guard launched a surprise military drill on disputed islands in the Persian Gulf, with swarms of small fast boats, paratroopers and missile units taking part.The renewed hostilities come as Iran now enriches uranium closer than ever to weapons-grade levels after the collapse of its 2015 nuclear deal with world powers.The U.S. also has pursued ships across the world believed to be carrying sanctioned Iranian oil. Oil industry worries over another seizure by Iran likely has left a ship allegedly carrying Iranian oil stranded off Texas as no company has yet to unload it."
    },
    {
        "text": "Although leprosy rates are on the rise in Florida, travellers heading to the sunshine state have a minimal risk of contracting the disease, according to the Public Health Agency of Canada (PHAC).On Wednesday, a spokesperson from the federal health department told Global News in an email that leprosy is a rare disease and the risk to Canadian travellers to the United States is considered “very low.”“Leprosy does not spread through casual contact with an infected person, for example, shaking hands or hugging, sharing meals, or sitting next to each other,” the spokesperson stated. “Infection requires close, frequent contact with someone with untreated leprosy over a period of months.”PHAC added there are currently no special precautions related to leprosy recommended for Canadians travelling to the region, and they will continue to closely monitor the situation.The message comes days after the U.S. Centers for Disease Control and Prevention (CDC) issued a warning saying leprosy may be on the path to becoming endemic in Florida. The department added that travellers heading to the southeastern region of the U.S., specifically central Florida, should be mindful of the potential risk of transmission.“Florida, USA, has witnessed an increased incidence of leprosy cases lacking traditional risk factors,” the CDC said in a report published on Monday. “Those trends, in addition to decreasing diagnoses in foreign-born persons, contribute to rising evidence that leprosy has become endemic in the southeastern United States.“Travel to Florida should be considered when conducting leprosy contact tracing in any state.”Leprosy, also known as Hansen’s disease, is a chronic infectious disease caused by the bacterium Mycobacterium leprae. It primarily affects the skin, nerves, and, in severe cases, other organs. The disease is characterized by skin lesions, loss of sensation and nerve damage.If detected early, leprosy can be cured with antibiotics.Although the disease is still quite rare in the U.S., since the early 2000s, the CDC said there has been a “gradual increase” in cases, with the number of reported cases more than doubling in the southeastern states over the last decade.Leprosy is not endemic to Canada, according to PHAC, adding that cases diagnosed here are acquired outside of the country.There have been between one and 12 cases annually reported to the Canadian Notifiable Disease Surveillance System between 2017 and 2021, PHAC added."
    },
    {
        "text": "Fighters from Russia’s private Wagner mercenary force are being moved close to NATO’s eastern flank to destabilize the military alliance, Poland’s prime minister said on Thursday.Wagner soldiers have begun training with the Belarus national army, prompting Poland to start moving more than 1,000 troops closer to the border. On Tuesday it accused Belarus of violating its airspace with military helicopters.“We need to be aware that the number of provocations will rise,” Mateusz Morawiecki said after meeting Lithuanian President Gitanas Nauseda in eastern Poland.“The Wagner group is extremely dangerous and they are being moved to the eastern flank to destabilize it.”The politicians met in the Suwalki Gap, a sparsely populated but strategically important area of Polish territory between Belarus and the Russian exclave of Kaliningrad that joins the Baltic states to other NATO members.Nauseda said the number of Wagner fighters in Belarus could be higher than 4,000.“We must not only talk about measures at the national level but also … what should be done if this situation becomes even more complicated, including the closure of the border with Belarus,” Nauseda said.“This should be done in a coordinated manner between Poland, Lithuania and Latvia.”Belarus allowed Russian President Vladimir Putin to use its territory as a launch pad for the Ukraine invasion, but has not committed its own troops to the war."
    },
    {
        "text": "Hundreds of people rallied in support of Niger’s ruling junta in the capital on Thursday, denouncing France and others who have criticized a recent coup – as the country’s military leaders sought to exploit anti-Western sentiment to shore up their takeover.As numbers began to swell at a demonstration organized by the junta and civil society groups on Niger’s independence day, protesters in Niamey pumped their fists in the air and chanted out support for neighboring countries that have also seen military takeovers in recent years. Some waved Russian flags, and one man brandished a Russian and Nigerien flag sewn together.Last week’s coup toppled President Mohamed Bazoum – whose ascendency marked Niger’s first peaceful, democratic transfer of power since its independence from France. It has been accompanied by strident anti-French sentiment and raised questions about the future of the fight against extremism in Africa’s Sahel region, where Russia and Western countries have vied for influence.The coup has been strongly condemned by Western countries and the West African regional bloc known as ECOWAS, which has threatened to use force to remove the junta if they don’t hand back power to Bazoum. As tensions have grown in the capital and the region, many European countries have moved to evacuate their citizens.At Thursday’s protest, many expressed support for the coup leaders and denounced interference from others.“For more than 13 years, the Nigerien people have suffered injustices,” said protester Moctar Abdou Issa. The junta “will get us out of this, God willing ? they will free the Nigerien people.”“We’re sick of the French,” he added.It remains unclear whether the majority of the population supports the coup – and in many parts of the capital, people went about their lives on Thursday as normal.In an address to the nation on Wednesday, the new military ruler, Gen. Abdourahmane Tchiani, lashed out at those who have condemned the coup and called on the population to be ready to defend the nation.Tchiani said Niger will face difficult times ahead and that the “hostile and radical” attitudes of those who oppose his rule provide no added value. He called harsh sanctions imposed last week by ECOWAS illegal, unfair, inhuman and unprecedented.The bloc has set a deadline of Aug. 6 for the junta to reinstate Bazoum, who remains under house arrest. Its sanctions include halting energy transactions with Niger, which gets up to 90% of its power from neighboring Nigeria, according to the International Renewable Energy Agency.In a closed door meeting on Wednesday, dozens of people from civil society organizations, professional groups and trade unions spoke with the coup leaders about their vision for the country.“We are talking about the immediate departure of all foreign forces,” Mahaman Sanoussi, interim coordinator for M62, an anti-French political alliance that organized Thursday’s protest, told The Associated Press. “The dignity of the Nigerien people will be respected by all without exception.”But another civil society member at the gathering who refused to be named for security reasons told the AP they left feeling concerned. They had a strong impression that the French military was going to be ousted soon and that members of civil society groups would help the junta do it.France has 1,500 soldiers in Niger who conduct joint operations with its military against jihadis linked to al-Qaida and the Islamic State group, and the United States and other European countries have helped train the nation’s troops. Niger was seen as the West’s last reliable partner in the region, but some in the country see Russia and its Wagner mercenary group, which operates in a handful of African countries, as a powerful alternative.The new junta has not said whether it intends to ally with Moscow or stick with Niger’s Western partners, but that question has become central to the unfolding political crisis. Neighboring Mali and Burkina Faso _ both ruled by juntas _ have turned toward Moscow.Even if Niger’s military rulers demand the withdrawal of French troops _ as happened in neighboring Mali and Burkina Faso _ it wouldn’t make a difference, said Anne-Claire Legendre, a spokesperson for the French foreign minister during a press briefing on Wednesday.“We don’t answer to the putschists. We recognize one constitutional order and one legitimacy only, that of President Bazoum,” she said.Ahead of Thursday’s demonstration, the French Embassy in Niamey asked Niger’s government to take all measures to ensure the security and protection of its premises after it was attacked by protesters a door was set on fire.The French military said that five flights using its planes had evacuated more than 1,000 people this week, and France’s Foreign Ministry said Thursday that its evacuation operation has ended.The State Department on Wednesday ordered what it said was the temporary departure of nonessential embassy staff and some family members from Niger as a precaution. It said its embassy would remain open. Pentagon press secretary Brig. Gen. Pat Ryder said that the State Department had not requested U.S. military assistance for the departure.U.S. President Joe Biden used the occasion of Niger’s independence day to call for Bazoum to be released and democracy restored.“The Nigerien people have the right to choose their leaders. They have expressed their will through free and fair elections _ and that must be respected,” he said in a statement Thursday.Earlier this week, Nigeria cut off power transmission to Niger, an official at one of Nigeria’s main electricity companies said, speaking on condition of anonymity because they were not authorized to comment on the issue.The official did not clarify how much of Niger’s power the cut represented, but any reduction would further squeeze citizens in the impoverished country of more than 25 million people where the electricity supply is already unreliable.On Wednesday, the president’s party accused the junta of cutting off electricity to his residence since that morning. “As a result, the president of the republic and his family no longer benefit from the rotating supply of energy,” said Kalla Ankourao, the ruling party’s general secretary.Associated Press writers Zane Irwin in Dakar, Senegal, and John Leicester in Paris contributed to this report."
    },
    {
        "text": "Israel’s Supreme Court heard a petition on Thursday against a law that protects Prime Minister Benjamin Netanyahu from being removed from office over claims of a conflict of interest due to his ongoing corruption trial.Netanyahu’s governing coalition passed a law in March that limits removing a prime minister from office to cases of medical and mental incapacitation. It would protect Netanyahu from being deemed unfit for office because of his ongoing corruption trial and claims of a conflict of interest. Critics say the law is tailor-made for Netanyahu and encourages corruption.A few dozen people protested outside Israel’s Supreme Court in Jerusalem as judges heard the petition by the Movement for Quality Government in Israel.The law passed earlier this year stipulates that a prime minister can only be deemed unfit to rule for health or mental reasons and that only the premier or the government can make that decision, not the attorney general.Netanyahu is on trial for charges of fraud, breach of trust and accepting bribes in three separate cases.The hearing came as Netanyahu and his allies are trying to pass a series of judicial overhaul bills that aim to curtail the power of the Supreme Court and give the ruling coalition control over the appointment of judges. It remained unclear when the court would issue a decision in the matter. "
    },
    {
        "text": "An online video shows Ukrainian soldiers driving an amphibious all-terrain vehicle through flooded streets in the southern city of Kherson, rescuing civilians trapped after a nearby damn was destroyed in June. And assisting with the evacuation effort, seated with the troops inside the ATV, is a 57-year-old rabbi.Moshe Azman, known as Ukraine’s chief rabbi, has swapped his kippah and kittel for a helmet and flak jacket. Since Russia launched its full-scale invasion last year, Azman has traversed the war-torn country to deliver aid and evacuate civilians from some of the most dangerous areas.That humanitarian work nearly cost his life. During his trip to the flooded city of Kherson in June, Azman was recording a video message when a Russian shell struck nearby, sending the bearded rabbi diving for cover. Fortunately, no one was hurt.“The Russians are shelling civilian people during evacuation missions,” he told Global News. “Before the war, I was a very quiet guy. Now, I cannot be quiet.”Azman was born in Russia and grew-up in Vladimir Putin’s hometown of Leningrad. His parents were Jewish but the Soviet Union forbade them from practicing their religion, so in 1987 Azman immigrated to Israel.He and his Ukrainian wife later moved to Kyiv, Ukraine, and in 2015 Azman opened a refugee ‘village’ for Jewish Ukrainians and others displaced by the fighting in the Donbas, named after Fiddler on the Roof’s fictional ‘Anatevka.’When Russia launched its full-scale invasion on February 24th, 2022, Azman’s refugee centre became a bomb shelter.“I thought it was a dream. I told myself to wake-up,” he said, describing the moment the first air raid sirens sounded in the Ukrainian capital.As explosions thundered in the distance, dozens of families huddled together inside the hall of the refugee centre, including members of Azman’s family.“I was very nervous because I have many people, women, children, my children were there and my small grandchildren,” he said.When the bombs finally stopped hours later, Azman went to his synagogue and recorded a video that would alter his trajectory.Speaking Russian and cradling a Torah scroll, he furiously condemned the Russian government, its military and what he called the silent indifference of the Russian people.“If God forbid, I have to die, then let the curse be on those who are silent and quietly participate in this attack,” he said, angrily slamming his fist on the podium.The six-minute video was posted on Facebook and received nearly one million views. So the rabbi recorded another video. And another. And another.17 months later, his social media platforms are full of viral videos recorded during his humanitarian missions in three languages: Russian, Ukrainian and English. The latter are meant for a Western audience, with the rabbi calling for more international support.This week, Azman brought that message to Canada, visiting the Toronto area and meeting with various Ukrainian and Jewish community groups. His Canadian visit follows earlier trips to Israel, the United Kingdom and the United States.“I would like to thank all the good people here, the Canadian government, Canadian people, Canadian organizations. They’ve given a lot of help for Ukraine. But please don’t be tired,” he said, citing concerns about growing donor fatigue among Ukraine’s allies.“My message is for people to continue to help Ukraine.”Alik Gomelsky, a Jewish-Ukrainian-Canadian author who helped to organize the visit, said the rabbi’s message is particularly important for members of the Jewish community, some of whom remain divided over support for Ukraine, he said.“It’s very important to spread the word of truth and saying the Jews and the Ukrainians are together,” Gomelsky said. “The rabbi has very good influence and he can convince and explain. People in Canada can listen and see a person who was actually on the front lines.”In his speeches and conversations, Azman fiercely pushes back against Russian President Vladimir Putin’s false claims that Russia is liberating Ukraine from Nazis.“We don’t have Nazis in Ukraine. Even anti-semitism in Ukraine is low,” Azman said, pointing to Ukraine’s Jewish President Volodymyr Zelenskyy, whom Azman has known for years prior to his election.“Please don’t make (Russian propaganda) out of the tragedy of the Jewish people.”Azman recalled growing-up in Russia and watching films about the Second World War, with scenes depicting the Soviet Red Army fighting back against the attacking German Nazi tanks.“The German Nazis did the mass killing of Jewish people,” he said. “Now it’s the Russian tanks that are attacking us.”"
    },
    {
        "text": "The federal government is trying to reclaim nearly $350 million in insurance paid to Suncor Energy Inc. in the wake of political unrest in Libya.The oil giant claimed $300 million in risk mitigation payments for losses linked to Libyan energy assets after fighting between rival political factions spread to the country’s oil crescent region in 2015, a Federal Court judge said in a ruling this week.The total — $347 million with interest — was determined by an arbitrator in 2019.But Export Development Canada, which insures against losses caused by political violence, argues that Suncor’s oil production facilities still deliver returns for the Calgary-based company.“According to EDC’s May 15, 2022, notice of arbitration, the Libyan assets continue to have significant value and generate revenue for Suncor and its subsidiaries. EDC seeks to recover the amounts realized in connection with the assets until the $347 million has been repaid in full,” judge Christine Pallotta wrote in the decision Monday.Suncor, which did not respond to a request for comment, says on its website that operations there continue to be impacted by political upheaval.“As of the end of 2015, production in Libya remains substantially shut-in given the political unrest. The timing of a return to normal operations remains uncertain,” the site states.Suncor also froze exploration in the oil-rich country in 2011 after civil war broke out, culminating in the capture and killing of president Muammar Gaddafi. “The period of force majeure under its contractual obligations has since ended in Libya, and Suncor has restarted exploration activities,” the site says.Suncor first built up its presence in Libya through Harouge Oil Operations, a joint venture with the state oil company in which Suncor has a 49 per cent stake dating back to 2008.With the two main parties in the court standoff unable to agree on an arbitrator, the judge on Monday appointed one to handle the insurance case and denied a request from four Suncor subsidiaries to be removed from it.The insurance claim was paid under a policy underwritten by Export Development Canada for Petro-Canada in 2006, which Suncor then came into following their merger in 2009.“The relevant claim related to Suncor’s oil operations in Libya was received following the Arab Spring movement that began in the early 2010s,” the Export Development Canada spokeswoman Jessica Draker said in an email Wednesday.“As EDC and Suncor are in active legal proceedings, we are limited in what we can share. … The ongoing arbitration between EDC and Suncor is a private process and is therefore confidential.'”By the end of 2022, the exposure of the Crown corporation’s political risk insurance portfolio sat at $359 million, down from $2.81 billion in 2015, according to its annual reports.“We stopped issuing new policies within this program in 2020,” the latest one states.About 57 per cent of the portfolio lay in the Africa and Middle East region, a far higher share than any other area."
    },
    {
        "text": "Indian authorities imposed a curfew, suspended internet service and deployed thousands of paramilitary forces on Tuesday to parts of northern Haryana state after deadly communal clashes spread to Gurugram, a city just outside the capital, New Delhi.The violence began Monday afternoon when Hindus and Muslims clashed with each other in Haryana’s Nuh district during a religious procession by a Hindu nationalist group, the Press Trust of India news agency reported. At least four people, including two police officers, were killed in the clashes.The clashes started when far-right Hindu Nationalist groups Vishwa Hindu Parishad and Bajrang Dal held a religious process through the Muslim quarter of Haryana’s Nuh district. Shopfronts, vehicles, and even public buses were destroyed during the clashes. Thousands of police and paramilitary forces have been deployed to Nuh, which has also seen internet services temporarily suspended.More than 20 police officers were injured in the violence and dozens of cars were set on fire, a police statement said.Tensions later spilled over to Gurugram, some 30 kilometers (19 miles) from New Delhi, where mobs torched a mosque and killed a Muslim cleric late Monday night. Police said some attackers have been arrested.There were no reports of fresh violence from either place on Tuesday, but authorities said they had ordered schools and colleges to remain shut as a precautionary measure.On Tuesday, baton-wielding police marched down the streets of Nuh littered which were with stones and charred vehicles in the areas where clashes took place, as fear-stricken residents remained indoors.“A large mob destroyed property, cars and hand carts. I stayed indoors to protect my family,” said local resident Mahendra, who only gave his first name.Another local, Akram Qureshi, said many families abandoned the violence-stricken neighborhoods out of fear.Haryana Chief Minister Manohar Lal Khattar, in a post on the social media platform X, formerly known as Twitter, condemned the violence in Nuh.“The guilty will not be spared at any cost. Strictest action will be taken against them,” he said.The state’s home minister, Anil Vij, alleged the violence was “engineered” and said police will investigate the clashes.Communal violence in India is not new, with periodic clashes breaking out ever since the British partition of the Indian subcontinent in 1947, but observers say that religious polarization has risen under Prime Minister Narendra Modi, further deepening fault lines against minorities and heightening tensions.With files from Reuters"
    },
    {
        "text": "Russia attacked Ukraine’s main inland port across the Danube River from Romania on Wednesday, sending global food prices higher as it ramped up its use of force to prevent Ukraine from exporting grain.The drone attacks destroyed buildings in the port of Izmail and halted ships as they prepared to arrive there to load with Ukrainian grain in defiance of a de-facto blockade Russia reimposed in mid-July.Ukrainian Deputy Prime Minister Oleksandr Kubrakov said the Russian attacks damaged almost 40,000 tons of grain which had been destined for countries in Africa as well as China and Israel.“Moscow is waging a battle for a global catastrophe,” President Volodymyr Zelenskyy said in his nightly video address.“In their madness, they need world food markets to collapse, they need a price crisis, they need disruptions in supplies.”Russian state news agency RIA said the port and grain infrastructure hit was housing foreign mercenaries and military hardware. A naval ship repair yard was also targeted, it said. Reuters was not able to verify the report.Video released by Ukrainian authorities showed firefighters on ladders battling a blaze high in a building covered with broken windows. Several other large buildings were in ruins, and grain spilled out of at least two wrecked silos.There were no reports of casualties, Odesa regional governor Oleh Kiper wrote in a post on the Telegram messaging app.Commercial ship-tracking data showed dozens of international ships halting and dropping anchor at the mouth of the Danube, many of them registered to arrive in Izmail in an apparent attempt to breach Russia’s blockade.The port, across the river from NATO-member Romania, is the main alternative route out of Ukraine for grain exports, since Russia’s blockade halted traffic at Ukraine’s Black Sea ports in mid-July.Two industry sources told Reuters operations at the port were suspended. Seaport authority head Yuriy Lytvyn said on Facebook that repair work had already begun and the port infrastructure continued to operate.Chicago wheat pricesWv1 rose by nearly 5% on supply concerns after the attack, only to tumble later on Wednesday on strong Russian exports and signs Moscow may be open to reviving the Black Sea corridor deal.Ukraine is one of the world’s top grain exporters. Russia has attacked its agricultural and port infrastructure for more than two weeks after refusing to extend the Black Sea agreement, which had lifted its war-time blockade of Ukrainian ports last year.The United Nations has warned of a potential food crisis in the world’s poorest countries due to Russia’s decision to abandon the deal, brokered by the U.N. and Turkey.The Kremlin said President Vladimir Putin spoke by telephone Turkish President Tayyip Erdogan and reiterated Russia’s condition for rejoining the agreement: that a parallel deal improving terms for its own food and fertilizer exports be implemented. Those exports are already exempt from sanctions, which the West says Moscow aims to undermine by threatening the global food supply.Erdogan’s office said he and Putin agreed the Russian leader would soon visit Turkey. Putin, wanted by the International Criminal Court for war crimes, has made no official visits abroad this year, and has left former Soviet territory only once since launching his invasion – a day trip to Tehran more than a year ago. Erdogan has said he hopes to host Putin and convince him to rejoin the grain deal.Moscow has described recent attacks on Ukraine’s grain infrastructure as retaliation for a Ukrainian strike on a bridge across the Kerch Strait to Crimea used to supply its troops in southern Ukraine.Russia’s defense ministry imposed restrictions on movement of ships and aircraft in the strait on Wednesday, the TASS news agency reported. It did not give a reason for the move.U.S. Ambassador to Ukraine Bridget Brink condemned Russia’s attacks in a statement, listing recent targets: “Homes. Ports. Grain silos. Historic buildings. Men. Women. Children.“Round-the-clock and intensifying Russian strikes on Kryvyi Rih, Kharkiv, Kyiv, Kherson make it clear once again Russia has no desire for peace, no thought for civilian safety, and no regard for people around the world who rely on food from Ukraine.”Ukrainian officials say Moscow has hit 26 port facilities, five civilian vessels and 180,000 tonnes of grain in nine days of strikes since quitting the grain deal.Kyiv says the goal of the strikes is to reimpose Russia’s blockade by persuading shippers and their insurance companies that Ukrainian ports are unsafe to resume exports.Ukraine’s Danube River ports such as Izmail accounted for around a quarter of grain exports before Russia pulled out of the Black Sea deal, and have since become the main route out, with grain sent on barges to Romania’s Black Sea port of Constanta for shipment onwards.Kyiv’s goal is for international ships to go straight to its Danube ports and load directly, while Moscow says it will treat ships heading to Ukrainian seaports as potential military targets.Asked about the situation on Wednesday, deputy U.N. spokesperson Farhan Haq told reporters: “We continue to reach out, at various levels, to make sure that we can continue to do as much as possible to get Ukrainian and Russian food and fertilizer out to markets, but it is difficult.”(Writing by Pavel Polityuk, Peter Graff, Hugh Lawson and Daniel Wallis; Additional reporting by Michelle Nichols; Editing by Simon Cameron-Moore, Philippa Fletcher, Giles Elgood and Cynthia Osterman)"
    }
]