[
    {
        "title": "Man rams car onto sidewalk and stabs pedestrians, 14 wounded in South Korea",
        "description": "At least 5 people were hurt by the car, and 9 others were stabbed in a shopping district near a subway station in the city of Seongnam.",
        "published": "Thu, 03 Aug 2023 18:41:28 +0000",
        "link": "https://globalnews.ca/news/9875594/man-rams-car-stabs-pedestrians-south-korea/"
    },
    {
        "title": "U.S. considers putting military on commercial ships in Strait of Hormuz amid seizures",
        "description": "It comes as thousands of Marines and sailors on both the amphibious assault ship USS Bataan and the USS Carter Hall, a landing ship, are on their way to the Persian Gulf.",
        "published": "Thu, 03 Aug 2023 17:10:04 +0000",
        "link": "https://globalnews.ca/news/9875288/us-military-commercial-ships-strait-of-hormuz-iran/"
    },
    {
        "title": "Canadian travellers’ risk of leprosy ‘very low’ despite Florida uptick",
        "description": "Although leprosy rare are on the rise in Florida, travellers heading to the sunshine state have a minimal risk of contracting the disease.",
        "published": "Thu, 03 Aug 2023 14:06:15 +0000",
        "link": "https://globalnews.ca/news/9874699/leprosy-florida-canada-travellers-risk/"
    },
    {
        "title": "Wagner fighters trying to unsettle NATO’s eastern flank, Polish PM says",
        "description": "Fighters from Russia's private Wagner mercenary force are being moved close to NATO's eastern flank to destabilize the military alliance, Poland's prime minister said on Thursday.",
        "published": "Thu, 03 Aug 2023 12:09:14 +0000",
        "link": "https://globalnews.ca/news/9874615/wagner-belarus-nato-poland/"
    },
    {
        "title": "Niger’s military leaders shore up support as hundreds rally in the capital",
        "description": "The coup has been strongly condemned by Western countries and the West African regional bloc known as ECOWAS, which has threatened to use force.",
        "published": "Thu, 03 Aug 2023 11:55:58 +0000",
        "link": "https://globalnews.ca/news/9874579/niger-coup-demonstration/"
    },
    {
        "title": "Israeli law protecting PM Netanyahu challenged in Supreme Court",
        "description": "Netanyahu's governing coalition passed a law in March that limits removing a prime minister from office to cases of medical and mental incapacitation.",
        "published": "Thu, 03 Aug 2023 11:26:00 +0000",
        "link": "https://globalnews.ca/news/9874538/israel-judicial-reform-supreme-court-petition/"
    },
    {
        "title": "Ukraine’s ‘Chief Rabbi’ becomes wartime leader after viral videos",
        "description": "Moshe Azman, known as Ukraine's chief rabbi, has swapped his kippah and kittel for a helmet and flak jacket.",
        "published": "Thu, 03 Aug 2023 10:00:52 +0000",
        "link": "https://globalnews.ca/news/9873356/ukraines-chief-rabbi-becomes-wartime-leader-after-viral-videos/"
    },
    {
        "title": "Feds try to reclaim $347 million insurance payout to Suncor linked to Libya unrest",
        "description": "Export Development Canada, which insures against losses caused by political violence, argues that Suncor's facilities in Libya still deliver returns for the Calgary-based company.",
        "published": "Wed, 02 Aug 2023 22:05:09 +0000",
        "link": "https://globalnews.ca/news/9873637/export-development-canada-insurance-payout-suncor-libya-unrest/"
    },
    {
        "title": "Curfew imposed in parts of northern India as 5 killed in religious violence",
        "description": "The clashes started when far-right Hindu Nationalist groups Vishwa Hindu Parishad and Bajrang Dal held a religious process through the Muslim quarter of Haryana's Nuh district.",
        "published": "Wed, 02 Aug 2023 17:05:34 +0000",
        "link": "https://globalnews.ca/news/9872125/curfew-imposed-in-parts-of-northern-india-as-5-killed-in-religious-violence/"
    },
    {
        "title": "Russia strikes Ukrainian port near Romanian border, sending grain prices higher",
        "description": "Russia has relentlessly attacked Ukrainian agricultural and port infrastructure for more than two weeks, since refusing to extend the Black Sea agreement.",
        "published": "Wed, 02 Aug 2023 11:37:29 +0000",
        "link": "https://globalnews.ca/news/9872028/russia-ukraine-romania-border/"
    }
]