[
    {
        "title": "Leprosy cases on the rise in Florida. Should travellers be concerned?",
        "description": "Amidst a concerning rise in leprosy cases across Florida, the CDC issued a warning saying the disease may be on the path to becoming endemic in the region.",
        "published": "Tue, 01 Aug 2023 20:34:33 +0000",
        "link": "https://globalnews.ca/news/9869675/leprosy-cases-florida-endemic/"
    },
    {
        "title": "Remains of missing hiker found 37 years later in melting glacier",
        "description": "The hiker's body was discovered on a thawing portion of the Theodul Glacier near the Matterhorn in the Swiss Alps.",
        "published": "Tue, 01 Aug 2023 18:28:36 +0000",
        "link": "https://globalnews.ca/news/9869761/remains-missing-hiker-found-37-years-later-melting-glacier-swiss-alps/"
    },
    {
        "title": "Niger coup ‘threatens the stability’ of region, Canada says. What to know",
        "description": "On July 26, Niger’s presidential guard claimed to have overthrown Mohamed Bazoum, the country's democratically elected president, after detaining him in his palace.",
        "published": "Tue, 01 Aug 2023 17:39:36 +0000",
        "link": "https://globalnews.ca/news/9869485/niger-coup-canada-explainer/"
    },
    {
        "title": "Is that a human in costume? Chinese zoo insists its sun bear is real",
        "description": "A video of a Malayan sun bear standing on its hind legs sparked a viral debate after observers pointed out its strange appearance and behaviour.",
        "published": "Tue, 01 Aug 2023 16:13:44 +0000",
        "link": "https://globalnews.ca/news/9869407/sun-bear-chinese-zoo-human-costume/"
    },
    {
        "title": "Instagram daredevil falls to his death scaling skyscraper in Hong Kong",
        "description": "Police said they discovered the body of Frenchman Remi Lucidi, who used the name 'Remi Enigma' on social media, on a patio near the base of a skyscraper.",
        "published": "Tue, 01 Aug 2023 16:06:06 +0000",
        "link": "https://globalnews.ca/news/9869434/remi-lucidi-dead-french-daredevil-building-fall/"
    },
    {
        "title": "Meta preparing AI-powered chatbots in effort to retain users: report",
        "description": "Meta has been designing prototypes for chatbots that can have humanlike discussions with its users, as the company attempts to boost its engagement with its social media platforms.",
        "published": "Tue, 01 Aug 2023 12:06:47 +0000",
        "link": "https://globalnews.ca/news/9869343/meta-ai-chatbots/"
    },
    {
        "title": "Australia recommends potential ban of China’s WeChat on government devices",
        "description": "Tuesday's report contains 17 recommendations including new transparency rules enforceable by fines and investigating a ban on WeChat on government devices.",
        "published": "Tue, 01 Aug 2023 11:55:23 +0000",
        "link": "https://globalnews.ca/news/9869337/australia-china-wechat-ban/"
    },
    {
        "title": "Beijing wants to mobilize Chinese citizens in counter-espionage",
        "description": "The call to popularize anti-spying work among the masses follows an expansion of China's counter-espionage law that took effect in July.",
        "published": "Tue, 01 Aug 2023 11:45:15 +0000",
        "link": "https://globalnews.ca/news/9869325/beijing-china-counter-espionage/"
    },
    {
        "title": "Myanmar’s jailed ex-leader Aung San Suu Kyi given partial clemency",
        "description": "The clemency was announced after Myanmar's military extended the state of emergency it imposed when it seized power from Suu Kyi's elected government more than two years ago.",
        "published": "Tue, 01 Aug 2023 11:36:17 +0000",
        "link": "https://globalnews.ca/news/9869310/myanmar-aung-san-suu-kyi-prison-sentence/"
    },
    {
        "title": "Russia blames Ukraine as drone attack damages Moscow building",
        "description": "Russian officials have claimed that the intensified attacks on the capital region reflect failures in Ukraine's counteroffensive.",
        "published": "Tue, 01 Aug 2023 11:09:39 +0000",
        "link": "https://globalnews.ca/news/9869296/russia-ukraine-drone-attacks-moscow/"
    }
]