[
    {
        "text": "Amidst a concerning rise in leprosy cases across Florida, the U.S. Centers for Disease Control and Prevention (CDC) issued a warning saying the disease may be on the path to becoming endemic in the region.Travellers heading to the southeastern region of the United States, specifically central Florida, should be mindful of the potential risk of transmission, the CDC stated.“Florida, USA, has witnessed an increased incidence of leprosy cases lacking traditional risk factors,” the CDC said in a report published on Monday. “Those trends, in addition to decreasing diagnoses in foreign-born persons, contribute to rising evidence that leprosy has become endemic in the southeastern United States.“Travel to Florida should be considered when conducting leprosy contact tracing in any state.”In 2020, 159 new cases of leprosy were reported in the U.S., according to the country’s National Hansen’s Disease Program. Florida was among the top reporting states. And Central Florida accounted for 81 per cent of cases in the state. That makes up one-fifth of reported cases in the entire country.Leprosy, also known as Hansen’s disease, is an age-old infectious disease caused by the bacteria Mycobacterium leprae that affects the skin and nerves.These bacteria are very slow growing and often may take up to 20 years to manifest after initial infection, according to the CDC. The bacteria attack the nerves, which can become swollen under the skin and cause the affected areas to lose the ability to sense touch and pain. If left untreated, it can also result in paralysis of the hands and feet.Leprosy is not highly contagious and although it’s not exactly known how it transmits between people, the CDC said it may happen when an infected person coughs or sneezes, and a healthy person breathes in the droplets containing the bacteria. However, prolonged, close contact with someone with untreated leprosy over many months is needed to catch the disease, the health department added.If detected early, leprosy can be cured with antibiotics.Although very rare, cases of the disease have been reported in Canada.For example, in Ontario, a very small number of imported cases occur per year, according to Public Health Ontario (PHO). The last data available shows that in 2021, there was one reported case. In 2016, there were six reported cases.Global News reached out to Health Canada for comment about current leprosy rates in the country but did not hear back at the time of publication.Historically, leprosy has been rare in the U.S., with its peak occurrence happening around 1983, as reported by the CDC. Following that, there was a significant decline in the number of documented cases annually from the 1980s through 2000.But since then, the CDC said, reports show a “gradual increase” in cases, with the number of reported cases more than doubling in the southeastern states over the last decade.The notable difference is that previous cases primarily involved individuals who immigrated from leprosy-endemic regions around the world. However, according to the CDC’s report, during the period from 2015 to 2020, approximately 34 per cent of new cases seemed to have contracted the disease locally, raising concerns about potential transmission within the U.S.For example, the department said in 2022 a 54-year-old man living in central Florida became sick with the disease without risk factors for known transmission routes. He went to a dermatology clinic looking for treatment for a painful and worsening red rash. The rash initially appeared on his hands and feet and then spread to his face. Biopsies taken from the affected area showed that he had leprosy.He said he had not recently travelled, had prolonged contact with immigrants from leprosy-endemic regions, or associations with individuals known to have leprosy, the CDC said. He lived in central Florida his entire life, works in landscaping and spends extended periods outdoors, the department flagged.The CDC then suggested “environmental reservoirs as a potential source of transmission” for this patient.“Although the incidence of leprosy has been increasing, the rates of new diagnoses in persons born outside of the United States has been declining since 2002,” the CDC stated. “This information suggests that leprosy has become an endemic disease process in Florida.”The CDC then warned that any travel to this area, “should prompt consideration of leprosy in the appropriate clinical context.”"
    },
    {
        "text": "A retreating glacier in Switzerland has revealed the remains of a German mountain climber who was reported missing in September 1986.On July 12, the hiker’s body was discovered on a thawing portion of the Theodul Glacier near the Matterhorn in the Swiss Alps, according to a press release from the Valais Cantonal Police.Climbers in the region spotted the human remains alongside several pieces of equipment and reported the discovery to local authorities.A photo of a single brown hiking boot with red laces was shared in the police press report. In the image, the wet boot, and several pieces of rusty climbing gear, are seen atop the snow.The body and climbing gear were removed from the glacier and transported to the Swiss municipality of Sion for forensic analysis. There, officials determined the remains belonged to a 38-year-old German man who disappeared 37 years ago.Police have not publicly named the missing climber or the circumstances surrounding his death.Police in Valais said the retreat of glaciers in the region is “increasingly revealing mountaineers, whose disappearance was reported decades ago.”In 2022, glaciers in Switzerland saw the highest rate of melting since records were first created over a century ago. Last year, Swiss glaciers reportedly lost more than six per cent of their remaining volume.The monitoring body GLAMOS said the glacial decline is so severe that rock previously buried by the ice for a millennium can now be seen in portions of the Alps. Other smaller glaciers have disappeared altogether.Rising global temperatures and exceptionally low winter snowfall are believed to have caused the melt."
    },
    {
        "text": "Ottawa is joining calls for Niger’s president to be reinstated after he was ousted during an attempted coup in the West African country last week.President Mohamed Bazoum has been detained since July 26 after Niger’s presidential guard, which is headed by General Abdourahmane Tchiani, overran the government. He was appointed head of state on July 28 by a governing council set up by military forces.Niger’s coup could have serious consequences for democratic progress and the fight against an insurgency by jihadist militants in the region, where Niger is a key Western ally.Here is what you need to know.On July 26, Niger’s presidential guard claimed to have overthrown Bazoum, the country’s democratically elected president, after detaining him in his palace. He has yet to resign.Tchiani was sworn in two days later, and since then, the military-led regime has started to crack down on the government and civil liberties.On Sunday evening, four government officials were arrested including Mahamane Sani Mahamadou, the minister of petroleum and son of former President Mahamadou Issoufou; Kassoum Moctar, minister of education; Ousseini Hadizatou Yacouba, the minister of mines, and Foumakoye Gado, the president of the ruling party.That same night, military spokesperson Col. Maj. Amadou Abdramane said on state television that all government cars need to be returned by midday Monday and banned the use of social media to diffuse messages against state security.Niger’s airspace and land borders have also been closed.Tiani, the 62-year-old decorated general and former military attache at Niger’s embassy in Germany, has led the elite presidential guard unit since 2011.In a statement on state television on Friday, Tiani asked “the technical and financial partners and friends of Niger to understand the specific situation of our country and provide all necessary support to help it overcome the challenges it faces.”Reiterating that soldiers had seized power because of worsening security in the country, Tiani said, “We cannot continue with the same approaches proposed so far, as it risks witnessing the gradual and inevitable disappearance of our nation.”Insecurity has remained a problem since Bazoum was elected in 2021 as jihadists who took root in neighbouring Mali in 2012 gained ground, killing thousands and displacing over six million across the region.Since relations with Burkina Faso and Mali’s military-led governments soured, Niger’s role had become increasingly important for Western nations helping to fight the insurgency.West African nations on Monday gave the coup leaders one week to reinstate Bazoum and threatened to use force if their demands aren’t met.The announcement came at the end of an emergency meeting of the Economic Community of West African States (ECOWAS) Sunday.“In the event the authority’s demands are not met within one week, (the bloc will) take all measures necessary to restore constitutional order in the Republic of Niger. Such measures may include the use of force,” it said in a statement.The bloc also imposed strict sanctions, including suspending all commercial and financial transactions between ECOWAS member states and Niger, and freezing assets in regional central banks.The impacts could be severe, with Niger being the third-poorest country in the world, according to United Nations data. The country relies on imports from Nigeria for up to 90 per cent of its power, according to the International Renewable Energy Agency.The 15-nation ECOWAS bloc has unsuccessfully tried to restore democracies in nations where the military took power in recent years. Four nations are run by military governments in West and Central Africa, where there have been nine successful or attempted coups since 2020.Britain and the European Union have pulled aid from the country, while Washington has mulled following suit. France prepared to evacuate French and European nationals from Niger on Tuesday.Meanwhile, Canada is throwing its support behind ECOWAS.“Canada reiterates that President Mohamed Bazoum, his family and the detained members of the democratically elected government must be released immediately. We also support ECOWAS’s call for the reinstatement of President Bazoum as head of state within the timeframe prescribed by the regional organization,” Global Affairs Canada said in a statement Tuesday.“Canada condemns the coup attempt, which threatens the stability of Niger and the region. The forcible seizure of power by elements of the defence and security forces compromises the peace, stabilization and development efforts undertaken by the democratically elected government. Canada is committed to supporting democracy, inclusive governance and the rule of law.”Global Affairs Canada (GAC) is urging Canadians in need of emergency consular assistance to contact the Embassy of Canada in Bamako, Mali.Canada’s honorary consul of Niger “could be limited or unavailable without notice due to the ongoing security situation,” GAC said on its website.In its latest travel advisory, the government is warning against all travel to the nation and is advising Canadians in Niger to register with GAC, among other measures.There are currently 269 Canadians registered as being in Niger as of Tuesday, a GAC spokesperson told Global News.For Canadians in Niger, GAC advises them to exercise caution and be aware of their surroundings, avoid areas near government buildings, groups of security forces and where large gatherings are taking place, shelter in place if they can’t leave the area safely, keep doors and windows locked at all times and ensure personal belongings, such as a passport and other documents are secure at all times.Furthermore, GAC advises Canadians to remove any loose objects from outside their home that can be thrown at doors and windows, and follow the instructions of local authorities.Finally, sanctions on Niger may lead to shortages of necessities, therefore Canadians are advised to keep a supply of water, food, medicine and cash on hand, keep their phone charged and monitor local and international media to stay informed on the evolving situation.— with files from The Associated Press and Reuters"
    },
    {
        "text": "A Malayan sun bear named Angela living in a Chinese zoo has been the subject of much chatter after a video of her circulating online led to viral speculation that she is actually a human wearing a bear costume.The increased attention from the video has caused visitors to flock to the zoo to catch a glimpse of the newly minted internet star.A video of the bear standing on her hind legs while interacting with crowds around her enclosure quickly went viral after observers pointed out the bear’s strange appearance and behaviour. The bear stands quite close to the onlookers and moves her arms almost as if she’s waving.The main reason why people are skeptical about the authenticity of the bear is its behind — more specifically, its wrinkled bottom. The visible folds of skin when the bear stands up in the video resemble what a human would look like while wearing ill-fitting pants.The original video of Angela the bear that sparked discourse was posted to Douyin, the Chinese version of TikTok, on July 27. A few days later, amid a flood of headlines and online chatter, the Hangzhou Zoo was forced to come out with a statement denying its bear is a furry imposter.In a posting written from the bear’s perspective on Sunday, the zoo dismissed the rumours.“Some people think I stand like a human, and it seems that you don’t understand me that much,” the posting reads.“I got a call after work yesterday from the head of the zoo asking if I was being lazy and skipped work today and found a human to take my place,” the statement reads. “Let me emphasize again: I am a sun bear — not a black bear, not a dog — a sun bear!”Sun bears are the size of large dogs, standing at most 1.3 metres tall on their hind legs, compared with up to 2.8 metres for grizzlies and other species, according to the zoo. Native to Southeast Asia, sun bears are most easily identified by the patch of bright orange or cream-coloured fur on their chest.According to one wildlife biologist who spoke to NBC, the animal is “a sun bear for sure.”“Sun bears could be very human-like,” says Wong Siew Te, the founder of the Bornean Sun Bear Conservation Centre in Malaysia. “They stand like humans and walk like humans.”Te added that sun bear mothers even carry babies with their hands as they walk on their hind legs.As Angela the bear’s viral star has risen, so too has attendance at the Hangzhou Zoo, where she lives.Visitors numbers have increased by 30 per cent to about 20,000 a day, with some people travelling overnight to see her, local Chao News reported.“After seeing this bear standing up on the internet, I wanted to see how it looks in real life, so I came here,” said a man surnamed You, who said he had only half-believed the video he saw online.“After we saw the video on the internet, we specially took the high-speed train from Suzhou to come over to see the bear,” another visitor, Qian Ming, told a Hangzhou TV station. “We travelled overnight last night to get here. The bears are so cute.“In interviews with local media, the zoo has stated that Angela is “definitely not a human.”“Our zoo is government-run, so that kind of situation would not happen,” a member of staff said. “The temperature in the summer is nearly 40 degrees, if you put on a fur suit, you certainly couldn’t last more than a few minutes without lying down.”— With files from Reuters"
    },
    {
        "text": "In an apparent stunt gone wrong, French social media daredevil and photographer Remi Lucidi has died after a fall from a skyscraper in Hong Kong.Police in the region said they discovered the body of a 30-year-old man on a patio near Tregunter Tower on Thursday, according to numerous reports. Authorities believe Remi Lucidi, who used the name “Remi Enigma” on social media, may have fallen from the 68th storey while attempting a type of extreme sport.Lucidi regularly posted photos to Instagram — where he had a considerable following — of himself scaling the peaks of urban skyscrapers and high-rise buildings around the globe.A post shared by ʀᴇᴍɪ ᴇɴɪɢᴍᴀ (@remnigma)The practice, often called buildering or urban climbing, sees thrillseekers scale or traverse buildings or artificial structures to reach the top. Buildering (a combination of the words “building” and “bouldering”) is extremely dangerous and often illegal, and therefore usually done at night.Police believe Lucidi likely fell from a ledge outside the tower. Suicide is not suspected.Lucidi reportedly entered the building complex on Thursday and told security he was visiting a friend on the 40th floor, according to the South China Morning Post. Authorities believe Lucidi instead rode the elevator to the 49th floor, where he climbed stairs to the top of the building. Lucidi may have forced a locked door open in order to gain access.Police said Lucidi was seen next when he frantically knocked on the window to the tower’s 68th-floor penthouse suite around 7:30 p.m. local time. They believe Lucidi may have been trapped and was asking for entry back into the building.A maid inside the penthouse suite called police but did not allow Lucidi entrance.It is believed Lucidi likely lost his footing and fell to his death. His camera, which allegedly contained footage of extreme sports, was found alongside his body, police said. Police also received a complaint about a gas leak in the building but said Lucidi’s fall may have broken a gas pipe.Investigation into Lucidi’s death is ongoing.Only three days before his death, Lucidi posted an Instagram photo from Hong Kong.A post shared by ʀᴇᴍɪ ᴇɴɪɢᴍᴀ (@remnigma)Amid news of his death, Lucidi’s followers have flooded his comments with remorse and well wishes for his family.According to The Independent, Lucidi began buildering in 2016. Over the years, he shared photos of himself from building peaks all around the world, including Dubai, Ukraine, Bulgaria and France. He often used a camera-equipped drone to record breathtaking footage of his climbs.A post shared by ʀᴇᴍɪ ᴇɴɪɢᴍᴀ (@remnigma)In March, Lucidi posted a photo of himself with his feet dangling over a very tall structure apparently near Chernobyl in Ukraine. He captioned the photo “My Comfort Zone.”A post shared by ʀᴇᴍɪ ᴇɴɪɢᴍᴀ (@remnigma)Buildering is common around the world, including at home in Canada. The practice is illegal and often requires an urban climber to trespass or break and enter into private property."
    },
    {
        "text": "Meta Platforms is preparing to launch a range of artificial intelligence (AI) powered chatbots that exhibit different personalities as soon as September, the Financial Times reported on Tuesday.Meta has been designing prototypes for chatbots that can have humanlike discussions with its users, as the company attempts to boost its engagement with its social media platforms, according to the report, citing people with knowledge of the plans.The Menlo Park, California-based social media giant is even exploring a chatbot that speaks like Abraham Lincoln and another that advises on travel options in the style of a surfer, the report added. The purpose of these chatbots will be to provide a new search function as well as offer recommendations.The report comes as Meta executives are focusing on boosting retention on its new text-based app Threads, after the app lost more than half of its users in the weeks following its launch on July 5.Meta declined to comment on the FT report, when contacted by Reuters.The Facebook parent reported a strong rise in advertising revenue in its earnings last week, forecasting third-quarter revenue above market expectations.The company has been climbing back from a bruising 2022, buoyed by hype around emerging AI technology and an austerity drive in which it has shed around 21,000 employees since last fall.Meta launched a new version of its open-source artificial intelligence model in July called Llama 2 for commercial use, which will be distributed by Microsoft through its Azure cloud service and will run on the Windows operating system.Bloomberg News reported in July that Apple is working on AI offerings similar to OpenAI’s ChatGPT and Google’s Bard, adding that it has built its own framework, known as ‘Ajax’, to create large language models and is also testing a chatbot that some engineers call ‘Apple GPT’."
    },
    {
        "text": "A senate committee investigating how foreign powers use social media to interfere in Australia has recommended a swathe of rules and restrictions for social media platforms, including potentially banning Chinese messaging service WeChat on government devices.Tuesday’s report contains 17 recommendations including new transparency rules enforceable by fines, expanding an existing TikTok ban on government devices to contractors and investigating a ban on WeChat on government devices.Companies like TikTok and WeChat posed “unique national security risks” because their parent companies, ByteDance and Tencent, are headquartered in China and subject to its national security laws, committee chair Senator Paterson in a statement.“Platforms like TikTok and WeChat that are subject to the control of authoritarian regimes illustrate the broader cyber security risk to sensitive government information,” he said in a statement.The committee also recommended that Australia helps developing countries in the Indo-Pacific resist “malicious information operations” by authoritarian states.Led by Liberal Party Senator James Paterson, the five-person committee on foreign interference through social media includes two members from the ruling Labor party, although the report’s recommendations are not binding.The office of the Prime Minister and Minister for Home Affairs did not immediately respond to a request for comment.While many recommendations singled out Chinese social media platforms, a set of 11 transparency rules would require all large social media platforms to label state affiliated media accounts, and disclose when governments direct content moderation and actions against accounts of elected officials."
    },
    {
        "text": "China should encourage its citizens to join counter-espionage work, including creating channels for individuals to report suspicious activity as well as commending and rewarding them, the state security ministry said on Tuesday.A system that makes it “normal” for the masses to participate in counter-espionage must be established, wrote the Ministry of State Security, the main agency overlooking foreign intelligence and anti-spying, in its first post on its WeChat account, which went live on Monday.The call to popularize anti-spying work among the masses follows an expansion of China’s counter-espionage law that took effect in July.The law, which bans the transfer of information related to national security and interests which it does not specify, has alarmed the United States, saying foreign companies in China could be punished for regular business activities.The revised law allows authorities carrying out an anti-espionage probe to gain access to data, electronic equipment, and information on personal property.Political security is the top priority of national security, and the “core” of political security is the security of China’s political system, Minister of State Security Chen Yixin wrote in an article in a Chinese legal magazine in July.“The most fundamental is to safeguard the leadership and ruling position of the Communist Party of China and the socialist system with Chinese characteristics,” Chen said.In recent years, China has arrested and detained dozens of Chinese and foreign nationals on suspicion of espionage, including an executive at Japanese drugmaker Astellas Pharma in March.Australian journalist Cheng Lei, accused by China for providing state secrets to another country, has been detained since September 2020.China’s declaration that it is under threat from spies comes as Western nations, most prominently the United States, accuse China of espionage and cyberattacks, a charge that Beijing has rejected.The United States itself is the “empire of hacking,” a Chinese foreign ministry spokesperson has said.In protecting itself from espionage, China would need the participation of its people in building a defense line, the state security ministry wrote in its WeChat post."
    },
    {
        "text": "Myanmar’s military-led government has reduced the prison sentences of ousted leader Aung San Suu Kyi in a clemency connected to a religious holiday in the Buddhist-majority country, state media said Tuesday.Former President Win Myint also had his sentence reduced as part of the clemency granted to more than 7,000 prisoners.But Suu Kyi, 78, still must serve a total of 27 years out of the 33 she was originally imprisoned for.The head of Myanmar’s military council, Senior Gen. Min Aung Hlaing, granted the clemency order to reduce the sentences in five cases against Suu Kyi in which she was convicted for violating coronavirus restrictions, illegally importing and possessing walkie-talkies and sedition, according to a report on state MRTV.She was initially sentenced for 19 offenses that her supporters and rights group say were attempts to discredit her and legitimize the 2021 army takeover while preventing her return to politics.The clemency was announced a day after Myanmar’s military extended the state of emergency it imposed when it seized power from Suu Kyi’s elected government 2 1/2 years ago, forcing a further delay in elections it promised when it took over.Several of Suu Kyi’s cases are awaiting final appeals.Min Aung Hlaing pardoned a total of 7,749 prisoners and commuted the death sentences of others to commemorate the day the Buddha gave his first sermon, the MRTV report said.The army leader also granted amnesty to 125 foreign prisoners and 22 members of ethnic armed groups, it added. The announcement said he dropped cases against 72 people connected to ethnic armed groups.It wasn’t immediately clear if any of the released prisoners included the thousands of political detainees locked up for opposing army rule.According to the Assistance Association for Political Prisoners, a rights monitoring organization, 24,123 people have been arrested in Myanmar since the army takeover. At least 3,857 civilians have been killed by security forces in the same period, the group says.MRTV said it was necessary to extend the state of emergency for another six months because there is still a lot of work to be done to return the country to normalcy and time is needed to prepare for an election.The United Nations on Monday called on Myanmar to return to democratic rule.The clemency also came three weeks after Thai Foreign Minister Don Pramudwinai met Suu Kyi in prison, becoming the first foreign visitor to be granted access to her since she was detained. Don told journalists she was in good health and conveyed her willingness to engage in talks to resolve the crisis gripping her strife-torn nation.Suu Kyi has been unable to give her version of the July 9 meeting, said to have lasted about an hour-and-a-half. Myanmar’s military confirmed the meeting had been held, but said it had no details because its was one-on-one between the ousted leader and the Thai diplomat.Don revealed the event when he was attending a meeting in the Indonesian capital, Jakarta, of the Association of Southeast Asian Nations. ASEAN has been seeking to mediate an end to the violent conflict in Myanmar, which some members believe destabilizes the region."
    },
    {
        "text": "Russian authorities accused Kyiv early Tuesday of yet another attack on Moscow and its surroundings with drones, one of which hit the same building in the capital that was damaged by a drone just days ago in a similar attack.Russian officials have claimed that the intensified attacks on the capital region reflect failures in Ukraine’s counteroffensive, while Ukrainian President Volodymyr Zelenskyy said over the weekend that “the war is gradually coming back to Russian territory,” but stopped short of taking responsibility for the attacks.The repeated drone strikes underscore Moscow’s vulnerability as Russia’s war in Ukraine drags into its 18th month.Overnight, Russian forces attacked Kharkiv, Ukraine’s second-largest city, with Iranian-made Shahed drones, according to Kharkiv Gov. Oleh Syniehubov. One drone struck a three-story building at an educational institution in the Saltivka district, partially destroying the top two floors of the building, as well as the roof. No people were inside the building at the time of the attack.Three more drone strikes hit the area of a sports complex in the Shevchenkivskyi district of Kharkiv. A two-story building in the complex was partially damaged, and a 63-year-old security guard was wounded, according to Syniehubov.Russian forces shelled the city of Kherson on Tuesday morning and hit a medical facility, according to regional Gov. Roman Mrochko, killing a doctor and wounding one nurse.In Russia, the Defense Ministry said that it shot down two Ukrainian drones outside Moscow early Tuesday and jammed another, sending it crashing into a skyscraper in the Moscow City business district and damaging the building’s facade.Moscow Mayor Sergei Sobyanin said the drone crashed into the same building that was damaged in a similar attack early Sunday. IQ-Quarter, located 7.2 kilometers (4.5 miles) from the Kremlin, houses a number of government agencies, including the headquarters of the Ministry of Economic Development, the Ministry of Digital Development and Communications, and the Ministry of Industry and Trade. Sobyanin said the attack on Tuesday didn’t result in any casualties.It wasn’t clear why the same building was hit twice in a row. In both incidents, the Russian military said the drones that hit the skyscraper were jammed before crashing.Asked about how protected the Russian capital is, given that supposedly jammed drones hit the same building, Kremlin spokesman Dmitry Peskov redirected the question to the Defense Ministry, saying only that “the threat exists and measures are being taken.”Sobyanin said the drone that struck the building Tuesday hit the 21st floor, one of the floors housing the Economic Development ministry. Photos from the site of the crash showed several panels of glass missing, exposing the charred insides of the building, and about a dozen more were damaged. According to the mayor, 150 square meters (about 1,600 square feet) of the building’s glass facade was damaged.Russian news agency Interfax cited Darya Levchenko, an adviser to the economic development minister, as saying that the ministry’s staff was working from home on Tuesday, while damage to the office was being assessed.Zelenskyy’s adviser, Mykhailo Podolyak, tweeted that Moscow “is rapidly getting used to a full-fledged war, which, in turn, will soon move to the territory of the `authors of the war’ to collect all their debts,” without confirming or denying Kyiv’s involvement in the attack.The Russian military also said that Ukrainian forces tried to attack two of its warships in the Black Sea overnight, using maritime drones. Three drones targeted two patrol vessels, Sergei Kotov and Vasily Bykov, 340 kilometers (210 miles) southwest of the Russian-controlled city of Sevastopol on the Crimean Peninsula, the Defense Ministry reported. All three drones were destroyed, the report said.The attacks on Moscow and Crimea, which Russia illegally annexed from Ukraine in 2014, follow a deadly Russian missile strike on Kryvyi Rih, a city in central Ukraine and Zelenskyy’s hometown. Monday’s strike partially destroyed a residential building and killed seven people, wounding dozens more.Ukraine’s presidential office reported Tuesday morning that at least 12 civilians had been killed in the country over the previous 24 hours, and 104 people injured.The office reported that Monday’s attack on Kryvyi Rih killed seven people, including a 10-year-old girl, making it one of the deadliest attacks on civilians in recent weeks. Russian rockets struck a residential high-rise building and a university building in the attack, which also wounded 81 people, including seven children.Hanna Arhirova in Kyiv, Ukraine, and Yuras Karmanau in Berlin, contributed to this report."
    }
]